```
starting build "3443ba2d-c52a-42c2-89d0-cd3776e96cfe"
FETCHSOURCE
hint: Using 'master' as the name for the initial branch. This default branch name
hint: is subject to change. To configure the initial branch name to use in all
hint: of your new repositories, which will suppress this warning, call:
hint:
hint: 	git config --global init.defaultBranch <name>
hint:
hint: Names commonly chosen instead of 'master' are 'main', 'trunk' and
hint: 'development'. The just-created branch can be renamed via this command:
hint:
hint: 	git branch -m <name>
Initialized empty Git repository in /workspace/.git/
From https://github.com/roger2hk/static-ct
 * branch            84ce27017661a5fcda0f243bd7d1209a5fc4fe8e -> FETCH_HEAD
HEAD is now at 84ce270 Replace curl_test with CT Hammer in GCP Cloud Build
GitCommit:
84ce27017661a5fcda0f243bd7d1209a5fc4fe8e
SETUPBUILD
Using default tag: latest
latest: Pulling from alpine/terragrunt
ff8f8c379796: Pulling fs layer
b25858963423: Pulling fs layer
ebbbc0b12cf8: Pulling fs layer
e443ce81d02b: Pulling fs layer
73a0e0d3c532: Pulling fs layer
2ee2129620ee: Pulling fs layer
5e77edd9a9bb: Pulling fs layer
c9ac10191e7b: Pulling fs layer
3593f1289588: Pulling fs layer
ae3749735e58: Pulling fs layer
e443ce81d02b: Waiting
73a0e0d3c532: Waiting
2ee2129620ee: Waiting
3593f1289588: Waiting
5e77edd9a9bb: Waiting
ae3749735e58: Waiting
c9ac10191e7b: Waiting
ebbbc0b12cf8: Download complete
ff8f8c379796: Verifying Checksum
ff8f8c379796: Download complete
b25858963423: Verifying Checksum
b25858963423: Download complete
ff8f8c379796: Pull complete
73a0e0d3c532: Download complete
2ee2129620ee: Verifying Checksum
ae3749735e58: Download complete
ebbbc0b12cf8: Pull complete
c9ac10191e7b: Verifying Checksum
c9ac10191e7b: Download complete
3593f1289588: Verifying Checksum
3593f1289588: Download complete
e443ce81d02b: Pull complete
73a0e0d3c532: Pull complete
2ee2129620ee: Pull complete
5e77edd9a9bb: Pull complete
c9ac10191e7b: Pull complete
3593f1289588: Pull complete
ae3749735e58: Pull complete
Digest: sha256:d486d2a6a1c19b48e005a17cfe8412af458ad2320884fa47303e326c440d57bf
Status: Downloaded newer image for alpine/terragrunt:latest
docker.io/alpine/terragrunt:latest
16:10:28.313 INFO   terraform: - Installed hashicorp/google v6.12.0 (signed by HashiCorp)
16:10:28.410 INFO   terraform: - Installing hashicorp/tls v4.0.6...
16:10:28.974 INFO   terraform: - Installed hashicorp/tls v4.0.6 (signed by HashiCorp)
16:10:28.974 INFO   terraform: Terraform has been successfully initialized!
16:10:30.393 STDOUT terraform: module.secretmanager.tls_private_key.sctfe_ecdsa_p256: Refreshing state... [id=d8d7a8321b8d401b0b3e7ef8da4d473c58324b58]
16:10:30.542 STDOUT terraform: module.storage.google_project_service.storage_googleapis_com: Refreshing state... [id=transparency-dev-playground/storage.googleapis.com]
16:10:30.542 STDOUT terraform: module.storage.google_project_service.storage_component_googleapis_com: Refreshing state... [id=transparency-dev-playground/storage-component.googleapis.com]
16:10:30.542 STDOUT terraform: module.storage.google_project_service.serviceusage_googleapis_com: Refreshing state... [id=transparency-dev-playground/serviceusage.googleapis.com]
16:10:30.543 STDOUT terraform: module.storage.google_project_service.storage_api_googleapis_com: Refreshing state... [id=transparency-dev-playground/storage-api.googleapis.com]
16:10:30.543 STDOUT terraform: module.secretmanager.google_project_service.secretmanager_googleapis_com: Refreshing state... [id=transparency-dev-playground/secretmanager.googleapis.com]
16:10:30.543 STDOUT terraform: module.storage.google_spanner_instance.log_spanner: Refreshing state... [id=transparency-dev-playground/ci-static-ct]
16:10:30.544 STDOUT terraform: module.storage.google_storage_bucket.log_bucket: Refreshing state... [id=transparency-dev-playground-ci-static-ct-bucket]
16:10:30.628 STDOUT terraform: module.storage.google_spanner_database.dedup_db: Refreshing state... [id=ci-static-ct/ci-static-ct-dedup-db]
16:10:30.629 STDOUT terraform: module.storage.google_spanner_database.log_db: Refreshing state... [id=ci-static-ct/ci-static-ct-db]
16:10:33.895 STDOUT terraform: module.secretmanager.google_secret_manager_secret.sctfe_ecdsa_p256_public_key: Refreshing state... [id=projects/transparency-dev-playground/secrets/ci-static-ct-ecdsa-p256-public-key]
16:10:33.895 STDOUT terraform: module.secretmanager.google_secret_manager_secret.sctfe_ecdsa_p256_private_key: Refreshing state... [id=projects/transparency-dev-playground/secrets/ci-static-ct-ecdsa-p256-private-key]
16:10:33.951 STDOUT terraform: module.secretmanager.google_secret_manager_secret_version.sctfe_ecdsa_p256_public_key: Refreshing state... [id=projects/828026317866/secrets/ci-static-ct-ecdsa-p256-public-key/versions/1]
16:10:33.957 STDOUT terraform: module.secretmanager.google_secret_manager_secret_version.sctfe_ecdsa_p256_private_key: Refreshing state... [id=projects/828026317866/secrets/ci-static-ct-ecdsa-p256-private-key/versions/1]
16:10:34.028 STDOUT terraform: module.cloudrun.google_project_service.cloudrun_api: Refreshing state... [id=transparency-dev-playground/run.googleapis.com]
16:10:37.291 STDOUT terraform: module.cloudrun.google_cloud_run_v2_service.default: Refreshing state... [id=projects/transparency-dev-playground/locations/us-central1/services/ci-static-ct]
16:10:37.732 STDOUT terraform: Terraform used the selected providers to generate the following execution
16:10:37.732 STDOUT terraform: plan. Resource actions are indicated with the following symbols:
16:10:37.733 STDOUT terraform:   - destroy
16:10:37.733 STDOUT terraform: Terraform will perform the following actions:
16:10:37.733 STDOUT terraform:   # module.cloudrun.google_cloud_run_v2_service.default will be destroyed
16:10:37.733 STDOUT terraform:   - resource "google_cloud_run_v2_service" "default" {
16:10:37.733 STDOUT terraform:       - annotations             = {} -> null
16:10:37.733 STDOUT terraform:       - client                  = "terraform" -> null
16:10:37.733 STDOUT terraform:       - conditions              = [
16:10:37.733 STDOUT terraform:           - {
16:10:37.733 STDOUT terraform:               - last_transition_time = "2025-02-24T16:02:15.269212Z"
16:10:37.734 STDOUT terraform:               - state                = "CONDITION_SUCCEEDED"
16:10:37.734 STDOUT terraform:               - type                 = "RoutesReady"
16:10:37.734 STDOUT terraform:                 # (5 unchanged attributes hidden)
16:10:37.734 STDOUT terraform:             },
16:10:37.734 STDOUT terraform:           - {
16:10:37.734 STDOUT terraform:               - last_transition_time = "2025-02-24T16:02:10.442746Z"
16:10:37.734 STDOUT terraform:               - state                = "CONDITION_SUCCEEDED"
16:10:37.734 STDOUT terraform:               - type                 = "ConfigurationsReady"
16:10:37.734 STDOUT terraform:                 # (5 unchanged attributes hidden)
16:10:37.734 STDOUT terraform:             },
16:10:37.734 STDOUT terraform:         ] -> null
16:10:37.734 STDOUT terraform:       - create_time             = "2025-02-24T16:01:53.767498Z" -> null
16:10:37.734 STDOUT terraform:       - creator                 = "cloudbuild-prod-sa@transparency-dev-playground.iam.gserviceaccount.com" -> null
16:10:37.734 STDOUT terraform:       - custom_audiences        = [] -> null
16:10:37.734 STDOUT terraform:       - deletion_protection     = false -> null
16:10:37.734 STDOUT terraform:       - effective_annotations   = {} -> null
16:10:37.734 STDOUT terraform:       - effective_labels        = {
16:10:37.734 STDOUT terraform:           - "goog-terraform-provisioned" = "true"
16:10:37.735 STDOUT terraform:         } -> null
16:10:37.735 STDOUT terraform:       - etag                    = "\"CPGv8r0GEJCu_O0C/cHJvamVjdHMvdHJhbnNwYXJlbmN5LWRldi1wbGF5Z3JvdW5kL2xvY2F0aW9ucy91cy1jZW50cmFsMS9zZXJ2aWNlcy9jaS1zdGF0aWMtY3Q\"" -> null
16:10:37.735 STDOUT terraform:       - generation              = "1" -> null
16:10:37.735 STDOUT terraform:       - id                      = "projects/transparency-dev-playground/locations/us-central1/services/ci-static-ct" -> null
16:10:37.735 STDOUT terraform:       - ingress                 = "INGRESS_TRAFFIC_ALL" -> null
16:10:37.735 STDOUT terraform:       - invoker_iam_disabled    = false -> null
16:10:37.735 STDOUT terraform:       - labels                  = {} -> null
16:10:37.735 STDOUT terraform:       - last_modifier           = "cloudbuild-prod-sa@transparency-dev-playground.iam.gserviceaccount.com" -> null
16:10:37.735 STDOUT terraform:       - latest_created_revision = "projects/transparency-dev-playground/locations/us-central1/services/ci-static-ct/revisions/ci-static-ct-00001-d8c" -> null
16:10:37.735 STDOUT terraform:       - latest_ready_revision   = "projects/transparency-dev-playground/locations/us-central1/services/ci-static-ct/revisions/ci-static-ct-00001-d8c" -> null
16:10:37.735 STDOUT terraform:       - launch_stage            = "GA" -> null
16:10:37.736 STDOUT terraform:       - location                = "us-central1" -> null
16:10:37.736 STDOUT terraform:       - name                    = "ci-static-ct" -> null
16:10:37.736 STDOUT terraform:       - observed_generation     = "1" -> null
16:10:37.736 STDOUT terraform:       - project                 = "transparency-dev-playground" -> null
16:10:37.736 STDOUT terraform:       - reconciling             = false -> null
16:10:37.736 STDOUT terraform:       - terminal_condition      = [
16:10:37.736 STDOUT terraform:           - {
16:10:37.736 STDOUT terraform:               - last_transition_time = "2025-02-24T16:02:15.303248Z"
16:10:37.736 STDOUT terraform:               - state                = "CONDITION_SUCCEEDED"
16:10:37.736 STDOUT terraform:               - type                 = "Ready"
16:10:37.736 STDOUT terraform:                 # (5 unchanged attributes hidden)
16:10:37.736 STDOUT terraform:             },
16:10:37.736 STDOUT terraform:         ] -> null
16:10:37.736 STDOUT terraform:       - terraform_labels        = {
16:10:37.736 STDOUT terraform:           - "goog-terraform-provisioned" = "true"
16:10:37.736 STDOUT terraform:         } -> null
16:10:37.736 STDOUT terraform:       - traffic_statuses        = [
16:10:37.736 STDOUT terraform:           - {
16:10:37.736 STDOUT terraform:               - percent  = 100
16:10:37.737 STDOUT terraform:               - type     = "TRAFFIC_TARGET_ALLOCATION_TYPE_LATEST"
16:10:37.737 STDOUT terraform:                 # (3 unchanged attributes hidden)
16:10:37.737 STDOUT terraform:             },
16:10:37.737 STDOUT terraform:         ] -> null
16:10:37.737 STDOUT terraform:       - uid                     = "aede84ee-9166-4cb7-93c0-51e0559b5bf1" -> null
16:10:37.737 STDOUT terraform:       - update_time             = "2025-02-24T16:01:53.767498Z" -> null
16:10:37.737 STDOUT terraform:       - uri                     = "https://ci-static-ct-hprglv54za-uc.a.run.app" -> null
16:10:37.737 STDOUT terraform:       - urls                    = [
16:10:37.737 STDOUT terraform:           - "https://ci-static-ct-828026317866.us-central1.run.app",
16:10:37.737 STDOUT terraform:           - "https://ci-static-ct-hprglv54za-uc.a.run.app",
16:10:37.737 STDOUT terraform:         ] -> null
16:10:37.737 STDOUT terraform:         # (4 unchanged attributes hidden)
16:10:37.737 STDOUT terraform:       - template {
16:10:37.737 STDOUT terraform:           - annotations                      = {} -> null
16:10:37.737 STDOUT terraform:           - labels                           = {} -> null
16:10:37.737 STDOUT terraform:           - max_instance_request_concurrency = 700 -> null
16:10:37.737 STDOUT terraform:           - service_account                  = "cloudrun-ci-sa@transparency-dev-playground.iam.gserviceaccount.com" -> null
16:10:37.738 STDOUT terraform:           - session_affinity                 = false -> null
16:10:37.738 STDOUT terraform:           - timeout                          = "5s" -> null
16:10:37.738 STDOUT terraform:             # (3 unchanged attributes hidden)
16:10:37.738 STDOUT terraform:           - containers {
16:10:37.738 STDOUT terraform:               - args        = [
16:10:37.738 STDOUT terraform:                   - "--logtostderr",
16:10:37.738 STDOUT terraform:                   - "--v=1",
16:10:37.738 STDOUT terraform:                   - "--http_endpoint=:6962",
16:10:37.738 STDOUT terraform:                   - "--bucket=transparency-dev-playground-ci-static-ct-bucket",
16:10:37.738 STDOUT terraform:                   - "--spanner_db_path=projects/transparency-dev-playground/instances/ci-static-ct/databases/ci-static-ct-db",
16:10:37.738 STDOUT terraform:                   - "--spanner_dedup_db_path=projects/transparency-dev-playground/instances/ci-static-ct/databases/ci-static-ct-dedup-db",
16:10:37.738 STDOUT terraform:                   - "--roots_pem_file=/bin/test_root_ca_cert.pem",
16:10:37.738 STDOUT terraform:                   - "--origin=ci-static-ct",
16:10:37.738 STDOUT terraform:                   - "--signer_public_key_secret_name=projects/828026317866/secrets/ci-static-ct-ecdsa-p256-public-key/versions/1",
16:10:37.738 STDOUT terraform:                   - "--signer_private_key_secret_name=projects/828026317866/secrets/ci-static-ct-ecdsa-p256-private-key/versions/1",
16:10:37.739 STDOUT terraform:                 ] -> null
16:10:37.739 STDOUT terraform:               - command     = [] -> null
16:10:37.739 STDOUT terraform:               - depends_on  = [] -> null
16:10:37.739 STDOUT terraform:               - image       = "us-central1-docker.pkg.dev/transparency-dev-playground/docker-ci/conformance-gcp:latest" -> null
16:10:37.739 STDOUT terraform:               - name        = "conformance" -> null
16:10:37.739 STDOUT terraform:                 # (1 unchanged attribute hidden)
16:10:37.739 STDOUT terraform:               - ports {
16:10:37.739 STDOUT terraform:                   - container_port = 6962 -> null
16:10:37.739 STDOUT terraform:                   - name           = "http1" -> null
16:10:37.739 STDOUT terraform:                 }
16:10:37.739 STDOUT terraform:               - resources {
16:10:37.739 STDOUT terraform:                   - cpu_idle          = false -> null
16:10:37.739 STDOUT terraform:                   - limits            = {
16:10:37.739 STDOUT terraform:                       - "cpu"    = "2000m"
16:10:37.740 STDOUT terraform:                       - "memory" = "1Gi"
16:10:37.740 STDOUT terraform:                     } -> null
16:10:37.740 STDOUT terraform:                   - startup_cpu_boost = false -> null
16:10:37.740 STDOUT terraform:                 }
16:10:37.740 STDOUT terraform:               - startup_probe {
16:10:37.740 STDOUT terraform:                   - failure_threshold     = 6 -> null
16:10:37.740 STDOUT terraform:                   - initial_delay_seconds = 1 -> null
16:10:37.740 STDOUT terraform:                   - period_seconds        = 10 -> null
16:10:37.740 STDOUT terraform:                   - timeout_seconds       = 1 -> null
16:10:37.740 STDOUT terraform:                   - tcp_socket {
16:10:37.740 STDOUT terraform:                       - port = 6962 -> null
16:10:37.740 STDOUT terraform:                     }
16:10:37.740 STDOUT terraform:                 }
16:10:37.740 STDOUT terraform:             }
16:10:37.740 STDOUT terraform:           - scaling {
16:10:37.740 STDOUT terraform:               - max_instance_count = 3 -> null
16:10:37.740 STDOUT terraform:               - min_instance_count = 0 -> null
16:10:37.740 STDOUT terraform:             }
16:10:37.740 STDOUT terraform:         }
16:10:37.740 STDOUT terraform:       - traffic {
16:10:37.740 STDOUT terraform:           - percent  = 100 -> null
16:10:37.740 STDOUT terraform:           - type     = "TRAFFIC_TARGET_ALLOCATION_TYPE_LATEST" -> null
16:10:37.741 STDOUT terraform:             # (2 unchanged attributes hidden)
16:10:37.741 STDOUT terraform:         }
16:10:37.741 STDOUT terraform:     }
16:10:37.741 STDOUT terraform:   # module.cloudrun.google_project_service.cloudrun_api will be destroyed
16:10:37.741 STDOUT terraform:   - resource "google_project_service" "cloudrun_api" {
16:10:37.741 STDOUT terraform:       - disable_on_destroy = false -> null
16:10:37.741 STDOUT terraform:       - id                 = "transparency-dev-playground/run.googleapis.com" -> null
16:10:37.741 STDOUT terraform:       - project            = "transparency-dev-playground" -> null
16:10:37.741 STDOUT terraform:       - service            = "run.googleapis.com" -> null
16:10:37.741 STDOUT terraform:     }
16:10:37.741 STDOUT terraform:   # module.secretmanager.google_project_service.secretmanager_googleapis_com will be destroyed
16:10:37.741 STDOUT terraform:   - resource "google_project_service" "secretmanager_googleapis_com" {
16:10:37.741 STDOUT terraform:       - disable_on_destroy = false -> null
16:10:37.741 STDOUT terraform:       - id                 = "transparency-dev-playground/secretmanager.googleapis.com" -> null
16:10:37.741 STDOUT terraform:       - project            = "transparency-dev-playground" -> null
16:10:37.741 STDOUT terraform:       - service            = "secretmanager.googleapis.com" -> null
16:10:37.741 STDOUT terraform:     }
16:10:37.741 STDOUT terraform:   # module.secretmanager.google_secret_manager_secret.sctfe_ecdsa_p256_private_key will be destroyed
16:10:37.742 STDOUT terraform:   - resource "google_secret_manager_secret" "sctfe_ecdsa_p256_private_key" {
16:10:37.742 STDOUT terraform:       - annotations           = {} -> null
16:10:37.742 STDOUT terraform:       - create_time           = "2025-02-24T16:00:56.594599Z" -> null
16:10:37.742 STDOUT terraform:       - effective_annotations = {} -> null
16:10:37.742 STDOUT terraform:       - effective_labels      = {
16:10:37.742 STDOUT terraform:           - "goog-terraform-provisioned" = "true"
16:10:37.742 STDOUT terraform:           - "label"                      = "sctfe-private-key"
16:10:37.742 STDOUT terraform:         } -> null
16:10:37.742 STDOUT terraform:       - id                    = "projects/transparency-dev-playground/secrets/ci-static-ct-ecdsa-p256-private-key" -> null
16:10:37.742 STDOUT terraform:       - labels                = {
16:10:37.742 STDOUT terraform:           - "label" = "sctfe-private-key"
16:10:37.742 STDOUT terraform:         } -> null
16:10:37.742 STDOUT terraform:       - name                  = "projects/828026317866/secrets/ci-static-ct-ecdsa-p256-private-key" -> null
16:10:37.742 STDOUT terraform:       - project               = "transparency-dev-playground" -> null
16:10:37.742 STDOUT terraform:       - secret_id             = "ci-static-ct-ecdsa-p256-private-key" -> null
16:10:37.742 STDOUT terraform:       - terraform_labels      = {
16:10:37.742 STDOUT terraform:           - "goog-terraform-provisioned" = "true"
16:10:37.743 STDOUT terraform:           - "label"                      = "sctfe-private-key"
16:10:37.743 STDOUT terraform:         } -> null
16:10:37.743 STDOUT terraform:       - version_aliases       = {} -> null
16:10:37.743 STDOUT terraform:         # (2 unchanged attributes hidden)
16:10:37.743 STDOUT terraform:       - replication {
16:10:37.743 STDOUT terraform:           - auto {
16:10:37.743 STDOUT terraform:             }
16:10:37.743 STDOUT terraform:         }
16:10:37.743 STDOUT terraform:     }
16:10:37.743 STDOUT terraform:   # module.secretmanager.google_secret_manager_secret.sctfe_ecdsa_p256_public_key will be destroyed
16:10:37.743 STDOUT terraform:   - resource "google_secret_manager_secret" "sctfe_ecdsa_p256_public_key" {
16:10:37.743 STDOUT terraform:       - annotations           = {} -> null
16:10:37.743 STDOUT terraform:       - create_time           = "2025-02-24T16:00:56.608980Z" -> null
16:10:37.743 STDOUT terraform:       - effective_annotations = {} -> null
16:10:37.743 STDOUT terraform:       - effective_labels      = {
16:10:37.743 STDOUT terraform:           - "goog-terraform-provisioned" = "true"
16:10:37.743 STDOUT terraform:           - "label"                      = "sctfe-public-key"
16:10:37.743 STDOUT terraform:         } -> null
16:10:37.743 STDOUT terraform:       - id                    = "projects/transparency-dev-playground/secrets/ci-static-ct-ecdsa-p256-public-key" -> null
16:10:37.743 STDOUT terraform:       - labels                = {
16:10:37.743 STDOUT terraform:           - "label" = "sctfe-public-key"
16:10:37.743 STDOUT terraform:         } -> null
16:10:37.743 STDOUT terraform:       - name                  = "projects/828026317866/secrets/ci-static-ct-ecdsa-p256-public-key" -> null
16:10:37.743 STDOUT terraform:       - project               = "transparency-dev-playground" -> null
16:10:37.744 STDOUT terraform:       - secret_id             = "ci-static-ct-ecdsa-p256-public-key" -> null
16:10:37.744 STDOUT terraform:       - terraform_labels      = {
16:10:37.744 STDOUT terraform:           - "goog-terraform-provisioned" = "true"
16:10:37.744 STDOUT terraform:           - "label"                      = "sctfe-public-key"
16:10:37.744 STDOUT terraform:         } -> null
16:10:37.744 STDOUT terraform:       - version_aliases       = {} -> null
16:10:37.744 STDOUT terraform:         # (2 unchanged attributes hidden)
16:10:37.744 STDOUT terraform:       - replication {
16:10:37.744 STDOUT terraform:           - auto {
16:10:37.744 STDOUT terraform:             }
16:10:37.744 STDOUT terraform:         }
16:10:37.744 STDOUT terraform:     }
16:10:37.744 STDOUT terraform:   # module.secretmanager.google_secret_manager_secret_version.sctfe_ecdsa_p256_private_key will be destroyed
16:10:37.744 STDOUT terraform:   - resource "google_secret_manager_secret_version" "sctfe_ecdsa_p256_private_key" {
16:10:37.744 STDOUT terraform:       - create_time           = "2025-02-24T16:00:56.786771Z" -> null
16:10:37.744 STDOUT terraform:       - deletion_policy       = "DELETE" -> null
16:10:37.744 STDOUT terraform:       - enabled               = true -> null
16:10:37.744 STDOUT terraform:       - id                    = "projects/828026317866/secrets/ci-static-ct-ecdsa-p256-private-key/versions/1" -> null
16:10:37.745 STDOUT terraform:       - is_secret_data_base64 = false -> null
16:10:37.745 STDOUT terraform:       - name                  = "projects/828026317866/secrets/ci-static-ct-ecdsa-p256-private-key/versions/1" -> null
16:10:37.745 STDOUT terraform:       - secret                = "projects/transparency-dev-playground/secrets/ci-static-ct-ecdsa-p256-private-key" -> null
16:10:37.745 STDOUT terraform:       - secret_data           = (sensitive value) -> null
16:10:37.745 STDOUT terraform:       - version               = "1" -> null
16:10:37.745 STDOUT terraform:         # (1 unchanged attribute hidden)
16:10:37.745 STDOUT terraform:     }
16:10:37.745 STDOUT terraform:   # module.secretmanager.google_secret_manager_secret_version.sctfe_ecdsa_p256_public_key will be destroyed
16:10:37.745 STDOUT terraform:   - resource "google_secret_manager_secret_version" "sctfe_ecdsa_p256_public_key" {
16:10:37.745 STDOUT terraform:       - create_time           = "2025-02-24T16:00:56.787260Z" -> null
16:10:37.745 STDOUT terraform:       - deletion_policy       = "DELETE" -> null
16:10:37.745 STDOUT terraform:       - enabled               = true -> null
16:10:37.745 STDOUT terraform:       - id                    = "projects/828026317866/secrets/ci-static-ct-ecdsa-p256-public-key/versions/1" -> null
16:10:37.746 STDOUT terraform:       - is_secret_data_base64 = false -> null
16:10:37.746 STDOUT terraform:       - name                  = "projects/828026317866/secrets/ci-static-ct-ecdsa-p256-public-key/versions/1" -> null
16:10:37.746 STDOUT terraform:       - secret                = "projects/transparency-dev-playground/secrets/ci-static-ct-ecdsa-p256-public-key" -> null
16:10:37.746 STDOUT terraform:       - secret_data           = (sensitive value) -> null
16:10:37.746 STDOUT terraform:       - version               = "1" -> null
16:10:37.746 STDOUT terraform:         # (1 unchanged attribute hidden)
16:10:37.746 STDOUT terraform:     }
16:10:37.746 STDOUT terraform:   # module.secretmanager.tls_private_key.sctfe_ecdsa_p256 will be destroyed
16:10:37.746 STDOUT terraform:   - resource "tls_private_key" "sctfe_ecdsa_p256" {
16:10:37.746 STDOUT terraform:       - algorithm                     = "ECDSA" -> null
16:10:37.746 STDOUT terraform:       - ecdsa_curve                   = "P256" -> null
16:10:37.746 STDOUT terraform:       - id                            = "d8d7a8321b8d401b0b3e7ef8da4d473c58324b58" -> null
16:10:37.746 STDOUT terraform:       - private_key_openssh           = (sensitive value) -> null
16:10:37.746 STDOUT terraform:       - private_key_pem               = (sensitive value) -> null
16:10:37.747 STDOUT terraform:       - private_key_pem_pkcs8         = (sensitive value) -> null
16:10:37.747 STDOUT terraform:       - public_key_fingerprint_md5    = "32:53:39:5c:33:3f:9b:1e:2a:78:f6:e8:8c:83:e7:b6" -> null
16:10:37.747 STDOUT terraform:       - public_key_fingerprint_sha256 = "SHA256:7+Bo+CsIOwkr5Y7S45KrztKm/KoQQP8pBWWPLBcHIy0" -> null
16:10:37.747 STDOUT terraform:       - public_key_openssh            = <<-EOT
16:10:37.747 STDOUT terraform:             ecdsa-sha2-nistp256 AAAAE2VjZHNhLXNoYTItbmlzdHAyNTYAAAAIbmlzdHAyNTYAAABBBKYKQ5FT2bspMTgtfuA80/YK6bzy7Tq03yzfq9kfdSfJ+hm1DcORBk3MqUrgE9YXx2eG211WNCtGH+VZn9HKzB0=
16:10:37.747 STDOUT terraform:         EOT -> null
16:10:37.747 STDOUT terraform:       - public_key_pem                = <<-EOT
16:10:37.747 STDOUT terraform:             -----BEGIN PUBLIC KEY-----
16:10:37.747 STDOUT terraform:             MFkwEwYHKoZIzj0CAQYIKoZIzj0DAQcDQgAEpgpDkVPZuykxOC1+4DzT9grpvPLt
16:10:37.747 STDOUT terraform:             OrTfLN+r2R91J8n6GbUNw5EGTcypSuAT1hfHZ4bbXVY0K0Yf5Vmf0crMHQ==
16:10:37.747 STDOUT terraform:             -----END PUBLIC KEY-----
16:10:37.747 STDOUT terraform:         EOT -> null
16:10:37.747 STDOUT terraform:       - rsa_bits                      = 2048 -> null
16:10:37.747 STDOUT terraform:     }
16:10:37.747 STDOUT terraform:   # module.storage.google_project_service.serviceusage_googleapis_com will be destroyed
16:10:37.748 STDOUT terraform:   - resource "google_project_service" "serviceusage_googleapis_com" {
16:10:37.748 STDOUT terraform:       - disable_on_destroy = false -> null
16:10:37.748 STDOUT terraform:       - id                 = "transparency-dev-playground/serviceusage.googleapis.com" -> null
16:10:37.748 STDOUT terraform:       - project            = "transparency-dev-playground" -> null
16:10:37.748 STDOUT terraform:       - service            = "serviceusage.googleapis.com" -> null
16:10:37.748 STDOUT terraform:     }
16:10:37.748 STDOUT terraform:   # module.storage.google_project_service.storage_api_googleapis_com will be destroyed
16:10:37.748 STDOUT terraform:   - resource "google_project_service" "storage_api_googleapis_com" {
16:10:37.748 STDOUT terraform:       - disable_on_destroy = false -> null
16:10:37.748 STDOUT terraform:       - id                 = "transparency-dev-playground/storage-api.googleapis.com" -> null
16:10:37.748 STDOUT terraform:       - project            = "transparency-dev-playground" -> null
16:10:37.748 STDOUT terraform:       - service            = "storage-api.googleapis.com" -> null
16:10:37.748 STDOUT terraform:     }
16:10:37.748 STDOUT terraform:   # module.storage.google_project_service.storage_component_googleapis_com will be destroyed
16:10:37.748 STDOUT terraform:   - resource "google_project_service" "storage_component_googleapis_com" {
16:10:37.748 STDOUT terraform:       - disable_on_destroy = false -> null
16:10:37.748 STDOUT terraform:       - id                 = "transparency-dev-playground/storage-component.googleapis.com" -> null
16:10:37.749 STDOUT terraform:       - project            = "transparency-dev-playground" -> null
16:10:37.749 STDOUT terraform:       - service            = "storage-component.googleapis.com" -> null
16:10:37.749 STDOUT terraform:     }
16:10:37.749 STDOUT terraform:   # module.storage.google_project_service.storage_googleapis_com will be destroyed
16:10:37.749 STDOUT terraform:   - resource "google_project_service" "storage_googleapis_com" {
16:10:37.749 STDOUT terraform:       - disable_on_destroy = false -> null
16:10:37.749 STDOUT terraform:       - id                 = "transparency-dev-playground/storage.googleapis.com" -> null
16:10:37.749 STDOUT terraform:       - project            = "transparency-dev-playground" -> null
16:10:37.749 STDOUT terraform:       - service            = "storage.googleapis.com" -> null
16:10:37.749 STDOUT terraform:     }
16:10:37.749 STDOUT terraform:   # module.storage.google_spanner_database.dedup_db will be destroyed
16:10:37.749 STDOUT terraform:   - resource "google_spanner_database" "dedup_db" {
16:10:37.749 STDOUT terraform:       - database_dialect         = "GOOGLE_STANDARD_SQL" -> null
16:10:37.749 STDOUT terraform:       - ddl                      = [
16:10:37.749 STDOUT terraform:           - "CREATE TABLE IDSeq (id INT64 NOT NULL, h BYTES(MAX) NOT NULL, idx INT64 NOT NULL, timestamp INT64 NOT NULL,) PRIMARY KEY (id, h)",
16:10:37.750 STDOUT terraform:         ] -> null
16:10:37.750 STDOUT terraform:       - deletion_protection      = false -> null
16:10:37.750 STDOUT terraform:       - enable_drop_protection   = false -> null
16:10:37.750 STDOUT terraform:       - id                       = "ci-static-ct/ci-static-ct-dedup-db" -> null
16:10:37.750 STDOUT terraform:       - instance                 = "ci-static-ct" -> null
16:10:37.750 STDOUT terraform:       - name                     = "ci-static-ct-dedup-db" -> null
16:10:37.750 STDOUT terraform:       - project                  = "transparency-dev-playground" -> null
16:10:37.750 STDOUT terraform:       - state                    = "READY" -> null
16:10:37.750 STDOUT terraform:       - version_retention_period = "1h" -> null
16:10:37.750 STDOUT terraform:     }
16:10:37.750 STDOUT terraform:   # module.storage.google_spanner_database.log_db will be destroyed
16:10:37.750 STDOUT terraform:   - resource "google_spanner_database" "log_db" {
16:10:37.750 STDOUT terraform:       - database_dialect         = "GOOGLE_STANDARD_SQL" -> null
16:10:37.750 STDOUT terraform:       - ddl                      = [
16:10:37.750 STDOUT terraform:           - "CREATE TABLE IF NOT EXISTS Tessera (id INT64 NOT NULL, compatibilityVersion INT64 NOT NULL) PRIMARY KEY (id)",
16:10:37.750 STDOUT terraform:           - "CREATE TABLE IF NOT EXISTS SeqCoord (id INT64 NOT NULL, next INT64 NOT NULL,) PRIMARY KEY (id)",
16:10:37.750 STDOUT terraform:           - "CREATE TABLE IF NOT EXISTS Seq (id INT64 NOT NULL, seq INT64 NOT NULL, v BYTES(MAX),) PRIMARY KEY (id, seq)",
16:10:37.751 STDOUT terraform:           - "CREATE TABLE IF NOT EXISTS IntCoord (id INT64 NOT NULL, seq INT64 NOT NULL, rootHash BYTES(32)) PRIMARY KEY (id)",
16:10:37.751 STDOUT terraform:         ] -> null
16:10:37.751 STDOUT terraform:       - deletion_protection      = false -> null
16:10:37.751 STDOUT terraform:       - enable_drop_protection   = false -> null
16:10:37.751 STDOUT terraform:       - id                       = "ci-static-ct/ci-static-ct-db" -> null
16:10:37.751 STDOUT terraform:       - instance                 = "ci-static-ct" -> null
16:10:37.751 STDOUT terraform:       - name                     = "ci-static-ct-db" -> null
16:10:37.751 STDOUT terraform:       - project                  = "transparency-dev-playground" -> null
16:10:37.751 STDOUT terraform:       - state                    = "READY" -> null
16:10:37.751 STDOUT terraform:       - version_retention_period = "1h" -> null
16:10:37.751 STDOUT terraform:     }
16:10:37.751 STDOUT terraform:   # module.storage.google_spanner_instance.log_spanner will be destroyed
16:10:37.751 STDOUT terraform:   - resource "google_spanner_instance" "log_spanner" {
16:10:37.751 STDOUT terraform:       - config                       = "projects/transparency-dev-playground/instanceConfigs/regional-us-central1" -> null
16:10:37.751 STDOUT terraform:       - default_backup_schedule_type = "NONE" -> null
16:10:37.751 STDOUT terraform:       - display_name                 = "ci-static-ct" -> null
16:10:37.752 STDOUT terraform:       - edition                      = "STANDARD" -> null
16:10:37.752 STDOUT terraform:       - effective_labels             = {
16:10:37.752 STDOUT terraform:           - "goog-terraform-provisioned" = "true"
16:10:37.752 STDOUT terraform:         } -> null
16:10:37.752 STDOUT terraform:       - force_destroy                = true -> null
16:10:37.752 STDOUT terraform:       - id                           = "transparency-dev-playground/ci-static-ct" -> null
16:10:37.752 STDOUT terraform:       - labels                       = {} -> null
16:10:37.752 STDOUT terraform:       - name                         = "ci-static-ct" -> null
16:10:37.752 STDOUT terraform:       - num_nodes                    = 0 -> null
16:10:37.752 STDOUT terraform:       - processing_units             = 100 -> null
16:10:37.752 STDOUT terraform:       - project                      = "transparency-dev-playground" -> null
16:10:37.752 STDOUT terraform:       - state                        = "READY" -> null
16:10:37.752 STDOUT terraform:       - terraform_labels             = {
16:10:37.752 STDOUT terraform:           - "goog-terraform-provisioned" = "true"
16:10:37.752 STDOUT terraform:         } -> null
16:10:37.752 STDOUT terraform:     }
16:10:37.752 STDOUT terraform:   # module.storage.google_storage_bucket.log_bucket will be destroyed
16:10:37.752 STDOUT terraform:   - resource "google_storage_bucket" "log_bucket" {
16:10:37.752 STDOUT terraform:       - default_event_based_hold    = false -> null
16:10:37.753 STDOUT terraform:       - effective_labels            = {
16:10:37.753 STDOUT terraform:           - "goog-terraform-provisioned" = "true"
16:10:37.753 STDOUT terraform:         } -> null
16:10:37.753 STDOUT terraform:       - enable_object_retention     = false -> null
16:10:37.753 STDOUT terraform:       - force_destroy               = true -> null
16:10:37.753 STDOUT terraform:       - id                          = "transparency-dev-playground-ci-static-ct-bucket" -> null
16:10:37.753 STDOUT terraform:       - labels                      = {} -> null
16:10:37.753 STDOUT terraform:       - location                    = "US-CENTRAL1" -> null
16:10:37.753 STDOUT terraform:       - name                        = "transparency-dev-playground-ci-static-ct-bucket" -> null
16:10:37.753 STDOUT terraform:       - project                     = "transparency-dev-playground" -> null
16:10:37.753 STDOUT terraform:       - project_number              = 828026317866 -> null
16:10:37.753 STDOUT terraform:       - public_access_prevention    = "inherited" -> null
16:10:37.753 STDOUT terraform:       - requester_pays              = false -> null
16:10:37.753 STDOUT terraform:       - self_link                   = "https://www.googleapis.com/storage/v1/b/transparency-dev-playground-ci-static-ct-bucket" -> null
16:10:37.753 STDOUT terraform:       - storage_class               = "STANDARD" -> null
16:10:37.753 STDOUT terraform:       - terraform_labels            = {
16:10:37.753 STDOUT terraform:           - "goog-terraform-provisioned" = "true"
16:10:37.754 STDOUT terraform:         } -> null
16:10:37.754 STDOUT terraform:       - uniform_bucket_level_access = true -> null
16:10:37.754 STDOUT terraform:       - url                         = "gs://transparency-dev-playground-ci-static-ct-bucket" -> null
16:10:37.754 STDOUT terraform:       - hierarchical_namespace {
16:10:37.754 STDOUT terraform:           - enabled = false -> null
16:10:37.754 STDOUT terraform:         }
16:10:37.754 STDOUT terraform:       - soft_delete_policy {
16:10:37.754 STDOUT terraform:           - effective_time             = "2025-02-24T16:00:53.597Z" -> null
16:10:37.754 STDOUT terraform:           - retention_duration_seconds = 604800 -> null
16:10:37.754 STDOUT terraform:         }
16:10:37.754 STDOUT terraform:     }
16:10:37.754 STDOUT terraform: Plan: 0 to add, 0 to change, 16 to destroy.
16:10:37.754 STDOUT terraform: Changes to Outputs:
16:10:37.754 STDOUT terraform:   - conformance_bucket_name           = "transparency-dev-playground-ci-static-ct-bucket" -> null
16:10:37.754 STDOUT terraform:   - conformance_url                   = "https://ci-static-ct-hprglv54za-uc.a.run.app" -> null
16:10:37.754 STDOUT terraform:   - ecdsa_p256_private_key_id         = "projects/828026317866/secrets/ci-static-ct-ecdsa-p256-private-key/versions/1" -> null
16:10:37.754 STDOUT terraform:   - ecdsa_p256_public_key_id          = "projects/828026317866/secrets/ci-static-ct-ecdsa-p256-public-key/versions/1" -> null
16:10:37.754 STDOUT terraform:   - ecdsa_p256_public_key_secret_data = (sensitive value) -> null
16:10:38.061 STDOUT terraform: module.cloudrun.google_cloud_run_v2_service.default: Destroying... [id=projects/transparency-dev-playground/locations/us-central1/services/ci-static-ct]
16:10:48.062 STDOUT terraform: module.cloudrun.google_cloud_run_v2_service.default: Still destroying... [id=projects/transparency-dev-playground/locations/us-central1/services/ci-static-ct, 10s elapsed]
16:10:48.283 STDOUT terraform: module.cloudrun.google_cloud_run_v2_service.default: Destruction complete after 10s
16:10:48.285 STDOUT terraform: module.cloudrun.google_project_service.cloudrun_api: Destroying... [id=transparency-dev-playground/run.googleapis.com]
16:10:48.286 STDOUT terraform: module.cloudrun.google_project_service.cloudrun_api: Destruction complete after 0s
16:10:48.288 STDOUT terraform: module.storage.google_project_service.storage_googleapis_com: Destroying... [id=transparency-dev-playground/storage.googleapis.com]
16:10:48.288 STDOUT terraform: module.storage.google_project_service.storage_component_googleapis_com: Destroying... [id=transparency-dev-playground/storage-component.googleapis.com]
16:10:48.288 STDOUT terraform: module.storage.google_project_service.serviceusage_googleapis_com: Destroying... [id=transparency-dev-playground/serviceusage.googleapis.com]
16:10:48.288 STDOUT terraform: module.storage.google_spanner_database.log_db: Destroying... [id=ci-static-ct/ci-static-ct-db]
16:10:48.288 STDOUT terraform: module.secretmanager.google_secret_manager_secret_version.sctfe_ecdsa_p256_private_key: Destroying... [id=projects/828026317866/secrets/ci-static-ct-ecdsa-p256-private-key/versions/1]
16:10:48.288 STDOUT terraform: module.storage.google_spanner_database.dedup_db: Destroying... [id=ci-static-ct/ci-static-ct-dedup-db]
16:10:48.291 STDOUT terraform: module.storage.google_project_service.storage_googleapis_com: Destruction complete after 0s
16:10:48.291 STDOUT terraform: module.storage.google_project_service.storage_api_googleapis_com: Destroying... [id=transparency-dev-playground/storage-api.googleapis.com]
16:10:48.291 STDOUT terraform: module.storage.google_project_service.storage_component_googleapis_com: Destruction complete after 0s
16:10:48.292 STDOUT terraform: module.secretmanager.google_secret_manager_secret_version.sctfe_ecdsa_p256_public_key: Destroying... [id=projects/828026317866/secrets/ci-static-ct-ecdsa-p256-public-key/versions/1]
16:10:48.293 STDOUT terraform: module.storage.google_project_service.serviceusage_googleapis_com: Destruction complete after 0s
16:10:48.293 STDOUT terraform: module.storage.google_storage_bucket.log_bucket: Destroying... [id=transparency-dev-playground-ci-static-ct-bucket]
16:10:48.293 STDOUT terraform: module.storage.google_project_service.storage_api_googleapis_com: Destruction complete after 0s
16:10:48.353 STDOUT terraform: module.secretmanager.google_secret_manager_secret_version.sctfe_ecdsa_p256_public_key: Destruction complete after 0s
16:10:48.354 STDOUT terraform: module.secretmanager.google_secret_manager_secret_version.sctfe_ecdsa_p256_private_key: Destruction complete after 0s
16:10:48.356 STDOUT terraform: module.secretmanager.google_secret_manager_secret.sctfe_ecdsa_p256_public_key: Destroying... [id=projects/transparency-dev-playground/secrets/ci-static-ct-ecdsa-p256-public-key]
16:10:48.356 STDOUT terraform: module.secretmanager.google_secret_manager_secret.sctfe_ecdsa_p256_private_key: Destroying... [id=projects/transparency-dev-playground/secrets/ci-static-ct-ecdsa-p256-private-key]
16:10:48.356 STDOUT terraform: module.secretmanager.tls_private_key.sctfe_ecdsa_p256: Destroying... [id=d8d7a8321b8d401b0b3e7ef8da4d473c58324b58]
16:10:48.358 STDOUT terraform: module.secretmanager.tls_private_key.sctfe_ecdsa_p256: Destruction complete after 0s
16:10:48.675 STDOUT terraform: module.secretmanager.google_secret_manager_secret.sctfe_ecdsa_p256_private_key: Destruction complete after 1s
16:10:48.680 STDOUT terraform: module.secretmanager.google_secret_manager_secret.sctfe_ecdsa_p256_public_key: Destruction complete after 1s
16:10:48.681 STDOUT terraform: module.secretmanager.google_project_service.secretmanager_googleapis_com: Destroying... [id=transparency-dev-playground/secretmanager.googleapis.com]
16:10:48.682 STDOUT terraform: module.secretmanager.google_project_service.secretmanager_googleapis_com: Destruction complete after 0s
16:10:48.979 STDOUT terraform: module.storage.google_spanner_database.dedup_db: Destruction complete after 1s
16:10:48.979 STDOUT terraform: module.storage.google_spanner_database.log_db: Destruction complete after 1s
16:10:48.981 STDOUT terraform: module.storage.google_spanner_instance.log_spanner: Destroying... [id=transparency-dev-playground/ci-static-ct]
16:10:49.440 STDOUT terraform: module.storage.google_spanner_instance.log_spanner: Destruction complete after 0s
16:10:50.864 STDOUT terraform: module.storage.google_storage_bucket.log_bucket: Destruction complete after 3s
16:10:51.015 STDOUT terraform: Destroy complete! Resources: 16 destroyed.
Finished Step #0 - "preclean_env"
Starting Step #1 - "docker_build_sctfe_gcp"
Already have image (with digest): gcr.io/cloud-builders/docker
Sending build context to Docker daemon  125.6MB
Step 1/12 : FROM golang:1.23.1-alpine3.19@sha256:ac67716dd016429be8d4c2c53a248d7bcdf06d34127d3dc451bda6aa5a87bc06 AS builder
docker.io/library/golang:1.23.1-alpine3.19@sha256:ac67716dd016429be8d4c2c53a248d7bcdf06d34127d3dc451bda6aa5a87bc06: Pulling from library/golang
43c4264eed91: Pulling fs layer
ab19dfae90ef: Pulling fs layer
e7bff916ab0c: Pulling fs layer
78cee99375e3: Pulling fs layer
4f4fb700ef54: Pulling fs layer
78cee99375e3: Waiting
4f4fb700ef54: Waiting
43c4264eed91: Verifying Checksum
43c4264eed91: Download complete
ab19dfae90ef: Download complete
43c4264eed91: Pull complete
4f4fb700ef54: Download complete
78cee99375e3: Verifying Checksum
78cee99375e3: Download complete
ab19dfae90ef: Pull complete
e7bff916ab0c: Verifying Checksum
e7bff916ab0c: Download complete
e7bff916ab0c: Pull complete
78cee99375e3: Pull complete
4f4fb700ef54: Pull complete
Digest: sha256:ac67716dd016429be8d4c2c53a248d7bcdf06d34127d3dc451bda6aa5a87bc06
Status: Downloaded newer image for golang:1.23.1-alpine3.19@sha256:ac67716dd016429be8d4c2c53a248d7bcdf06d34127d3dc451bda6aa5a87bc06
 ---> b5ada884192f
Step 2/12 : ARG GOFLAGS="-trimpath -buildvcs=false -buildmode=exe"
 ---> baf3021193c8
Step 6/12 : COPY go.sum .
 ---> 69afe77585fe
Step 7/12 : RUN go mod download
 ---> Running in 1bb79d997df8
Removing intermediate container 1bb79d997df8
 ---> a101134f9c89
Step 8/12 : COPY . .
 ---> 32d4fe67321a
Step 9/12 : RUN go build -o bin/sctfe-gcp ./cmd/gcp
 ---> Running in 2079bc8e5d1a
 ---> 73eb8ecf9cac
Step 12/12 : ENTRYPOINT ["/bin/sctfe-gcp"]
 ---> Running in ba287e87fb60
Removing intermediate container ba287e87fb60
 ---> 3394dbf3766b
Successfully built 3394dbf3766b
Successfully tagged sctfe-gcp:84ce270
Successfully tagged sctfe-gcp:latest
Finished Step #1 - "docker_build_sctfe_gcp"
Starting Step #2 - "docker_build_conformance_gcp"
Already have image (with digest): gcr.io/cloud-builders/docker
Sending build context to Docker daemon  125.6MB
Step 1/5 : FROM sctfe-gcp:latest AS base
 ---> 3394dbf3766b
Step 2/5 : FROM alpine:3.20.2@sha256:0a4eaa0eecf5f8c050e5bba433f58c052be7587ee8af3e8b3910ef9ab5fbe9f5
 ---> 324bc02ae123
Step 3/5 : COPY ./internal/hammer/testdata/test_root_ca_cert.pem /bin/
 ---> ba83febda27e
Step 4/5 : COPY --from=base /bin/sctfe-gcp /bin/
 ---> 4636943df3fa
Step 5/5 : ENTRYPOINT ["/bin/sctfe-gcp"]
 ---> Running in fa8518746775
Removing intermediate container fa8518746775
 ---> edf007810c79
Successfully built edf007810c79
Successfully tagged us-central1-docker.pkg.dev/transparency-dev-playground/docker-ci/conformance-gcp:84ce270
Successfully tagged us-central1-docker.pkg.dev/transparency-dev-playground/docker-ci/conformance-gcp:latest
Finished Step #2 - "docker_build_conformance_gcp"
Starting Step #3 - "docker_push_conformance_gcp"
Already have image (with digest): gcr.io/cloud-builders/docker
The push refers to repository [us-central1-docker.pkg.dev/transparency-dev-playground/docker-ci/conformance-gcp]
fd57622c0e88: Preparing
3b023870fa64: Preparing
78561cef0761: Preparing
78561cef0761: Layer already exists
3b023870fa64: Pushed
fd57622c0e88: Pushed
84ce270: digest: sha256:cbfadc74af416a06523cabd3f900ced8ff4504c4c9db0843f3971823cb91a99b size: 948
fd57622c0e88: Preparing
3b023870fa64: Preparing
78561cef0761: Preparing
fd57622c0e88: Layer already exists
3b023870fa64: Layer already exists
78561cef0761: Layer already exists
latest: digest: sha256:cbfadc74af416a06523cabd3f900ced8ff4504c4c9db0843f3971823cb91a99b size: 948
Finished Step #3 - "docker_push_conformance_gcp"
Starting Step #4 - "terraform_apply_conformance_ci"
Already have image (with digest): alpine/terragrunt
16:12:17.039 WARN   Using `terragrunt.hcl` as the root of Terragrunt configurations is an anti-pattern, and no longer recommended. In a future version of Terragrunt, this will result in an error. You are advised to use a differently named file like `root.hcl` instead. For more information, see https://terragrunt.gruntwork.io/docs/migrate/migrating-from-root-terragrunt-hcl
16:12:19.001 STDOUT terraform: Terraform used the selected providers to generate the following execution
16:12:19.002 STDOUT terraform: plan. Resource actions are indicated with the following symbols:
16:12:19.002 STDOUT terraform:   + create
16:12:19.002 STDOUT terraform: Terraform will perform the following actions:
16:12:19.002 STDOUT terraform:   # module.cloudrun.google_cloud_run_v2_service.default will be created
16:12:19.002 STDOUT terraform:   + resource "google_cloud_run_v2_service" "default" {
16:12:19.002 STDOUT terraform:       + client                  = "terraform"
16:12:19.002 STDOUT terraform:       + conditions              = (known after apply)
16:12:19.002 STDOUT terraform:       + create_time             = (known after apply)
16:12:19.002 STDOUT terraform:       + creator                 = (known after apply)
16:12:19.002 STDOUT terraform:       + delete_time             = (known after apply)
16:12:19.002 STDOUT terraform:       + deletion_protection     = false
16:12:19.002 STDOUT terraform:       + effective_annotations   = (known after apply)
16:12:19.002 STDOUT terraform:       + effective_labels        = {
16:12:19.002 STDOUT terraform:           + "goog-terraform-provisioned" = "true"
16:12:19.002 STDOUT terraform:         }
16:12:19.002 STDOUT terraform:       + etag                    = (known after apply)
16:12:19.002 STDOUT terraform:       + expire_time             = (known after apply)
16:12:19.002 STDOUT terraform:       + generation              = (known after apply)
16:12:19.003 STDOUT terraform:       + id                      = (known after apply)
16:12:19.003 STDOUT terraform:       + ingress                 = (known after apply)
16:12:19.003 STDOUT terraform:       + last_modifier           = (known after apply)
16:12:19.003 STDOUT terraform:       + latest_created_revision = (known after apply)
16:12:19.003 STDOUT terraform:       + latest_ready_revision   = (known after apply)
16:12:19.003 STDOUT terraform:       + launch_stage            = "GA"
16:12:19.003 STDOUT terraform:       + location                = "us-central1"
16:12:19.003 STDOUT terraform:       + name                    = "ci-static-ct"
16:12:19.003 STDOUT terraform:       + observed_generation     = (known after apply)
16:12:19.003 STDOUT terraform:       + project                 = "transparency-dev-playground"
16:12:19.003 STDOUT terraform:       + reconciling             = (known after apply)
16:12:19.003 STDOUT terraform:       + terminal_condition      = (known after apply)
16:12:19.003 STDOUT terraform:       + terraform_labels        = {
16:12:19.003 STDOUT terraform:           + "goog-terraform-provisioned" = "true"
16:12:19.003 STDOUT terraform:         }
16:12:19.003 STDOUT terraform:       + traffic_statuses        = (known after apply)
16:12:19.003 STDOUT terraform:       + uid                     = (known after apply)
16:12:19.003 STDOUT terraform:       + update_time             = (known after apply)
16:12:19.003 STDOUT terraform:       + uri                     = (known after apply)
16:12:19.003 STDOUT terraform:       + urls                    = (known after apply)
16:12:19.003 STDOUT terraform:       + template {
16:12:19.004 STDOUT terraform:           + max_instance_request_concurrency = 700
16:12:19.004 STDOUT terraform:           + service_account                  = "cloudrun-ci-sa@transparency-dev-playground.iam.gserviceaccount.com"
16:12:19.004 STDOUT terraform:           + timeout                          = "5s"
16:12:19.004 STDOUT terraform:           + containers {
16:12:19.004 STDOUT terraform:               + args  = (known after apply)
16:12:19.004 STDOUT terraform:               + image = "us-central1-docker.pkg.dev/transparency-dev-playground/docker-ci/conformance-gcp:latest"
16:12:19.004 STDOUT terraform:               + name  = "conformance"
16:12:19.004 STDOUT terraform:               + ports {
16:12:19.004 STDOUT terraform:                   + container_port = 6962
16:12:19.004 STDOUT terraform:                   + name           = (known after apply)
16:12:19.004 STDOUT terraform:                 }
16:12:19.004 STDOUT terraform:               + resources {
16:12:19.004 STDOUT terraform:                   + limits = {
16:12:19.004 STDOUT terraform:                       + "cpu"    = "2000m"
16:12:19.004 STDOUT terraform:                       + "memory" = "1Gi"
16:12:19.004 STDOUT terraform:                     }
16:12:19.004 STDOUT terraform:                 }
16:12:19.004 STDOUT terraform:               + startup_probe {
16:12:19.004 STDOUT terraform:                   + failure_threshold     = 6
16:12:19.004 STDOUT terraform:                   + initial_delay_seconds = 1
16:12:19.005 STDOUT terraform:                   + period_seconds        = 10
16:12:19.005 STDOUT terraform:                   + timeout_seconds       = 1
16:12:19.005 STDOUT terraform:                   + tcp_socket {
16:12:19.005 STDOUT terraform:                       + port = 6962
16:12:19.005 STDOUT terraform:                     }
16:12:19.005 STDOUT terraform:                 }
16:12:19.005 STDOUT terraform:             }
16:12:19.005 STDOUT terraform:           + scaling {
16:12:19.005 STDOUT terraform:               + max_instance_count = 3
16:12:19.005 STDOUT terraform:             }
16:12:19.005 STDOUT terraform:         }
16:12:19.005 STDOUT terraform:       + traffic (known after apply)
16:12:19.005 STDOUT terraform:     }
16:12:19.005 STDOUT terraform:   # module.cloudrun.google_project_service.cloudrun_api will be created
16:12:19.005 STDOUT terraform:   + resource "google_project_service" "cloudrun_api" {
16:12:19.005 STDOUT terraform:       + disable_on_destroy = false
16:12:19.005 STDOUT terraform:       + id                 = (known after apply)
16:12:19.005 STDOUT terraform:       + project            = "transparency-dev-playground"
16:12:19.005 STDOUT terraform:       + service            = "run.googleapis.com"
16:12:19.005 STDOUT terraform:     }
16:12:19.005 STDOUT terraform:   # module.secretmanager.google_project_service.secretmanager_googleapis_com will be created
16:12:19.005 STDOUT terraform:   + resource "google_project_service" "secretmanager_googleapis_com" {
16:12:19.005 STDOUT terraform:       + disable_on_destroy = false
16:12:19.006 STDOUT terraform:       + id                 = (known after apply)
16:12:19.006 STDOUT terraform:       + project            = "transparency-dev-playground"
16:12:19.006 STDOUT terraform:       + service            = "secretmanager.googleapis.com"
16:12:19.006 STDOUT terraform:     }
16:12:19.006 STDOUT terraform:   # module.secretmanager.google_secret_manager_secret.sctfe_ecdsa_p256_private_key will be created
16:12:19.006 STDOUT terraform:   + resource "google_secret_manager_secret" "sctfe_ecdsa_p256_private_key" {
16:12:19.006 STDOUT terraform:       + create_time           = (known after apply)
16:12:19.006 STDOUT terraform:       + effective_annotations = (known after apply)
16:12:19.006 STDOUT terraform:       + effective_labels      = {
16:12:19.006 STDOUT terraform:           + "goog-terraform-provisioned" = "true"
16:12:19.006 STDOUT terraform:           + "label"                      = "sctfe-private-key"
16:12:19.006 STDOUT terraform:         }
16:12:19.006 STDOUT terraform:       + expire_time           = (known after apply)
16:12:19.006 STDOUT terraform:       + id                    = (known after apply)
16:12:19.006 STDOUT terraform:       + labels                = {
16:12:19.006 STDOUT terraform:           + "label" = "sctfe-private-key"
16:12:19.006 STDOUT terraform:         }
16:12:19.006 STDOUT terraform:       + name                  = (known after apply)
16:12:19.007 STDOUT terraform:       + project               = "transparency-dev-playground"
16:12:19.007 STDOUT terraform:       + secret_id             = "ci-static-ct-ecdsa-p256-private-key"
16:12:19.007 STDOUT terraform:       + terraform_labels      = {
16:12:19.007 STDOUT terraform:           + "goog-terraform-provisioned" = "true"
16:12:19.007 STDOUT terraform:           + "label"                      = "sctfe-private-key"
16:12:19.007 STDOUT terraform:         }
16:12:19.007 STDOUT terraform:       + replication {
16:12:19.007 STDOUT terraform:           + auto {
16:12:19.007 STDOUT terraform:             }
16:12:19.007 STDOUT terraform:         }
16:12:19.007 STDOUT terraform:     }
16:12:19.007 STDOUT terraform:   # module.secretmanager.google_secret_manager_secret.sctfe_ecdsa_p256_public_key will be created
16:12:19.007 STDOUT terraform:   + resource "google_secret_manager_secret" "sctfe_ecdsa_p256_public_key" {
16:12:19.007 STDOUT terraform:       + create_time           = (known after apply)
16:12:19.007 STDOUT terraform:       + effective_annotations = (known after apply)
16:12:19.007 STDOUT terraform:       + effective_labels      = {
16:12:19.007 STDOUT terraform:           + "goog-terraform-provisioned" = "true"
16:12:19.007 STDOUT terraform:           + "label"                      = "sctfe-public-key"
16:12:19.007 STDOUT terraform:         }
16:12:19.007 STDOUT terraform:       + expire_time           = (known after apply)
16:12:19.007 STDOUT terraform:       + id                    = (known after apply)
16:12:19.008 STDOUT terraform:       + labels                = {
16:12:19.008 STDOUT terraform:           + "label" = "sctfe-public-key"
16:12:19.008 STDOUT terraform:         }
16:12:19.008 STDOUT terraform:       + name                  = (known after apply)
16:12:19.008 STDOUT terraform:       + project               = "transparency-dev-playground"
16:12:19.008 STDOUT terraform:       + secret_id             = "ci-static-ct-ecdsa-p256-public-key"
16:12:19.008 STDOUT terraform:       + terraform_labels      = {
16:12:19.008 STDOUT terraform:           + "goog-terraform-provisioned" = "true"
16:12:19.008 STDOUT terraform:           + "label"                      = "sctfe-public-key"
16:12:19.008 STDOUT terraform:         }
16:12:19.008 STDOUT terraform:       + replication {
16:12:19.008 STDOUT terraform:           + auto {
16:12:19.008 STDOUT terraform:             }
16:12:19.008 STDOUT terraform:         }
16:12:19.008 STDOUT terraform:     }
16:12:19.008 STDOUT terraform:   # module.secretmanager.google_secret_manager_secret_version.sctfe_ecdsa_p256_private_key will be created
16:12:19.008 STDOUT terraform:   + resource "google_secret_manager_secret_version" "sctfe_ecdsa_p256_private_key" {
16:12:19.008 STDOUT terraform:       + create_time           = (known after apply)
16:12:19.008 STDOUT terraform:       + deletion_policy       = "DELETE"
16:12:19.008 STDOUT terraform:       + destroy_time          = (known after apply)
16:12:19.008 STDOUT terraform:       + enabled               = true
16:12:19.009 STDOUT terraform:       + id                    = (known after apply)
16:12:19.009 STDOUT terraform:       + is_secret_data_base64 = false
16:12:19.009 STDOUT terraform:       + name                  = (known after apply)
16:12:19.009 STDOUT terraform:       + secret                = (known after apply)
16:12:19.009 STDOUT terraform:       + secret_data           = (sensitive value)
16:12:19.009 STDOUT terraform:       + version               = (known after apply)
16:12:19.009 STDOUT terraform:     }
16:12:19.009 STDOUT terraform:   # module.secretmanager.google_secret_manager_secret_version.sctfe_ecdsa_p256_public_key will be created
16:12:19.009 STDOUT terraform:   + resource "google_secret_manager_secret_version" "sctfe_ecdsa_p256_public_key" {
16:12:19.009 STDOUT terraform:       + create_time           = (known after apply)
16:12:19.009 STDOUT terraform:       + deletion_policy       = "DELETE"
16:12:19.009 STDOUT terraform:       + destroy_time          = (known after apply)
16:12:19.009 STDOUT terraform:       + enabled               = true
16:12:19.009 STDOUT terraform:       + id                    = (known after apply)
16:12:19.010 STDOUT terraform:       + is_secret_data_base64 = false
16:12:19.010 STDOUT terraform:       + name                  = (known after apply)
16:12:19.010 STDOUT terraform:       + secret                = (known after apply)
16:12:19.010 STDOUT terraform:       + secret_data           = (sensitive value)
16:12:19.010 STDOUT terraform:       + version               = (known after apply)
16:12:19.010 STDOUT terraform:     }
16:12:19.010 STDOUT terraform:   # module.secretmanager.tls_private_key.sctfe_ecdsa_p256 will be created
16:12:19.010 STDOUT terraform:   + resource "tls_private_key" "sctfe_ecdsa_p256" {
16:12:19.010 STDOUT terraform:       + algorithm                     = "ECDSA"
16:12:19.010 STDOUT terraform:       + ecdsa_curve                   = "P256"
16:12:19.010 STDOUT terraform:       + id                            = (known after apply)
16:12:19.010 STDOUT terraform:       + private_key_openssh           = (sensitive value)
16:12:19.010 STDOUT terraform:       + private_key_pem               = (sensitive value)
16:12:19.010 STDOUT terraform:       + private_key_pem_pkcs8         = (sensitive value)
16:12:19.010 STDOUT terraform:       + public_key_fingerprint_md5    = (known after apply)
16:12:19.011 STDOUT terraform:       + public_key_fingerprint_sha256 = (known after apply)
16:12:19.011 STDOUT terraform:       + public_key_openssh            = (known after apply)
16:12:19.011 STDOUT terraform:       + public_key_pem                = (known after apply)
16:12:19.011 STDOUT terraform:       + rsa_bits                      = 2048
16:12:19.011 STDOUT terraform:     }
16:12:19.011 STDOUT terraform:   # module.storage.google_project_service.serviceusage_googleapis_com will be created
16:12:19.011 STDOUT terraform:   + resource "google_project_service" "serviceusage_googleapis_com" {
16:12:19.011 STDOUT terraform:       + disable_on_destroy = false
16:12:19.011 STDOUT terraform:       + id                 = (known after apply)
16:12:19.011 STDOUT terraform:       + project            = "transparency-dev-playground"
16:12:19.011 STDOUT terraform:       + service            = "serviceusage.googleapis.com"
16:12:19.011 STDOUT terraform:     }
16:12:19.011 STDOUT terraform:   # module.storage.google_project_service.storage_api_googleapis_com will be created
16:12:19.011 STDOUT terraform:   + resource "google_project_service" "storage_api_googleapis_com" {
16:12:19.011 STDOUT terraform:       + disable_on_destroy = false
16:12:19.011 STDOUT terraform:       + id                 = (known after apply)
16:12:19.011 STDOUT terraform:       + project            = "transparency-dev-playground"
16:12:19.011 STDOUT terraform:       + service            = "storage-api.googleapis.com"
16:12:19.012 STDOUT terraform:     }
16:12:19.012 STDOUT terraform:   # module.storage.google_project_service.storage_component_googleapis_com will be created
16:12:19.012 STDOUT terraform:   + resource "google_project_service" "storage_component_googleapis_com" {
16:12:19.012 STDOUT terraform:       + disable_on_destroy = false
16:12:19.012 STDOUT terraform:       + id                 = (known after apply)
16:12:19.012 STDOUT terraform:       + project            = "transparency-dev-playground"
16:12:19.012 STDOUT terraform:       + service            = "storage-component.googleapis.com"
16:12:19.012 STDOUT terraform:     }
16:12:19.012 STDOUT terraform:   # module.storage.google_project_service.storage_googleapis_com will be created
16:12:19.012 STDOUT terraform:   + resource "google_project_service" "storage_googleapis_com" {
16:12:19.012 STDOUT terraform:       + disable_on_destroy = false
16:12:19.012 STDOUT terraform:       + id                 = (known after apply)
16:12:19.012 STDOUT terraform:       + project            = "transparency-dev-playground"
16:12:19.012 STDOUT terraform:       + service            = "storage.googleapis.com"
16:12:19.012 STDOUT terraform:     }
16:12:19.012 STDOUT terraform:   # module.storage.google_spanner_database.dedup_db will be created
16:12:19.012 STDOUT terraform:   + resource "google_spanner_database" "dedup_db" {
16:12:19.012 STDOUT terraform:       + database_dialect         = (known after apply)
16:12:19.013 STDOUT terraform:       + ddl                      = [
16:12:19.013 STDOUT terraform:           + "CREATE TABLE IDSeq (id INT64 NOT NULL, h BYTES(MAX) NOT NULL, idx INT64 NOT NULL, timestamp INT64 NOT NULL,) PRIMARY KEY (id, h)",
16:12:19.013 STDOUT terraform:         ]
16:12:19.013 STDOUT terraform:       + deletion_protection      = false
16:12:19.013 STDOUT terraform:       + enable_drop_protection   = false
16:12:19.013 STDOUT terraform:       + id                       = (known after apply)
16:12:19.013 STDOUT terraform:       + instance                 = "ci-static-ct"
16:12:19.013 STDOUT terraform:       + name                     = "ci-static-ct-dedup-db"
16:12:19.013 STDOUT terraform:       + project                  = "transparency-dev-playground"
16:12:19.013 STDOUT terraform:       + state                    = (known after apply)
16:12:19.013 STDOUT terraform:       + version_retention_period = (known after apply)
16:12:19.013 STDOUT terraform:     }
16:12:19.013 STDOUT terraform:   # module.storage.google_spanner_database.log_db will be created
16:12:19.013 STDOUT terraform:   + resource "google_spanner_database" "log_db" {
16:12:19.013 STDOUT terraform:       + database_dialect         = (known after apply)
16:12:19.013 STDOUT terraform:       + ddl                      = [
16:12:19.014 STDOUT terraform:           + "CREATE TABLE IF NOT EXISTS Tessera (id INT64 NOT NULL, compatibilityVersion INT64 NOT NULL) PRIMARY KEY (id)",
16:12:19.014 STDOUT terraform:           + "CREATE TABLE IF NOT EXISTS SeqCoord (id INT64 NOT NULL, next INT64 NOT NULL,) PRIMARY KEY (id)",
16:12:19.014 STDOUT terraform:           + "CREATE TABLE IF NOT EXISTS Seq (id INT64 NOT NULL, seq INT64 NOT NULL, v BYTES(MAX),) PRIMARY KEY (id, seq)",
16:12:19.014 STDOUT terraform:           + "CREATE TABLE IF NOT EXISTS IntCoord (id INT64 NOT NULL, seq INT64 NOT NULL, rootHash BYTES(32)) PRIMARY KEY (id)",
16:12:19.014 STDOUT terraform:         ]
16:12:19.014 STDOUT terraform:       + deletion_protection      = false
16:12:19.014 STDOUT terraform:       + enable_drop_protection   = false
16:12:19.014 STDOUT terraform:       + id                       = (known after apply)
16:12:19.014 STDOUT terraform:       + instance                 = "ci-static-ct"
16:12:19.014 STDOUT terraform:       + name                     = "ci-static-ct-db"
16:12:19.014 STDOUT terraform:       + project                  = "transparency-dev-playground"
16:12:19.014 STDOUT terraform:       + state                    = (known after apply)
16:12:19.014 STDOUT terraform:       + version_retention_period = (known after apply)
16:12:19.014 STDOUT terraform:     }
16:12:19.014 STDOUT terraform:   # module.storage.google_spanner_instance.log_spanner will be created
16:12:19.015 STDOUT terraform:   + resource "google_spanner_instance" "log_spanner" {
16:12:19.015 STDOUT terraform:       + config                       = "regional-us-central1"
16:12:19.015 STDOUT terraform:       + default_backup_schedule_type = "NONE"
16:12:19.015 STDOUT terraform:       + display_name                 = "ci-static-ct"
16:12:19.015 STDOUT terraform:       + edition                      = (known after apply)
16:12:19.015 STDOUT terraform:       + effective_labels             = {
16:12:19.015 STDOUT terraform:           + "goog-terraform-provisioned" = "true"
16:12:19.015 STDOUT terraform:         }
16:12:19.015 STDOUT terraform:       + force_destroy                = true
16:12:19.015 STDOUT terraform:       + id                           = (known after apply)
16:12:19.015 STDOUT terraform:       + name                         = "ci-static-ct"
16:12:19.015 STDOUT terraform:       + num_nodes                    = (known after apply)
16:12:19.015 STDOUT terraform:       + processing_units             = 100
16:12:19.015 STDOUT terraform:       + project                      = "transparency-dev-playground"
16:12:19.015 STDOUT terraform:       + state                        = (known after apply)
16:12:19.015 STDOUT terraform:       + terraform_labels             = {
16:12:19.015 STDOUT terraform:           + "goog-terraform-provisioned" = "true"
16:12:19.015 STDOUT terraform:         }
16:12:19.015 STDOUT terraform:     }
16:12:19.015 STDOUT terraform:   # module.storage.google_storage_bucket.log_bucket will be created
16:12:19.016 STDOUT terraform:   + resource "google_storage_bucket" "log_bucket" {
16:12:19.016 STDOUT terraform:       + effective_labels            = {
16:12:19.016 STDOUT terraform:           + "goog-terraform-provisioned" = "true"
16:12:19.016 STDOUT terraform:         }
16:12:19.016 STDOUT terraform:       + force_destroy               = true
16:12:19.016 STDOUT terraform:       + id                          = (known after apply)
16:12:19.016 STDOUT terraform:       + location                    = "US-CENTRAL1"
16:12:19.016 STDOUT terraform:       + name                        = "transparency-dev-playground-ci-static-ct-bucket"
16:12:19.016 STDOUT terraform:       + project                     = (known after apply)
16:12:19.016 STDOUT terraform:       + project_number              = (known after apply)
16:12:19.016 STDOUT terraform:       + public_access_prevention    = (known after apply)
16:12:19.016 STDOUT terraform:       + rpo                         = (known after apply)
16:12:19.016 STDOUT terraform:       + self_link                   = (known after apply)
16:12:19.016 STDOUT terraform:       + storage_class               = "STANDARD"
16:12:19.016 STDOUT terraform:       + terraform_labels            = {
16:12:19.016 STDOUT terraform:           + "goog-terraform-provisioned" = "true"
16:12:19.016 STDOUT terraform:         }
16:12:19.016 STDOUT terraform:       + uniform_bucket_level_access = true
16:12:19.016 STDOUT terraform:       + url                         = (known after apply)
16:12:19.017 STDOUT terraform:       + soft_delete_policy (known after apply)
16:12:19.017 STDOUT terraform:       + versioning (known after apply)
16:12:19.017 STDOUT terraform:       + website (known after apply)
16:12:19.017 STDOUT terraform:     }
16:12:19.017 STDOUT terraform: Plan: 16 to add, 0 to change, 0 to destroy.
16:12:19.017 STDOUT terraform: Changes to Outputs:
16:12:19.017 STDOUT terraform:   + conformance_bucket_name           = "transparency-dev-playground-ci-static-ct-bucket"
16:12:19.017 STDOUT terraform:   + conformance_url                   = (known after apply)
16:12:19.017 STDOUT terraform:   + ecdsa_p256_private_key_id         = (known after apply)
16:12:19.017 STDOUT terraform:   + ecdsa_p256_public_key_id          = (known after apply)
16:12:19.017 STDOUT terraform:   + ecdsa_p256_public_key_secret_data = (sensitive value)
16:12:19.160 STDOUT terraform: module.secretmanager.tls_private_key.sctfe_ecdsa_p256: Creating...
16:12:19.163 STDOUT terraform: module.secretmanager.tls_private_key.sctfe_ecdsa_p256: Creation complete after 0s [id=52426d9cfafb769f86aa108b31bc550ba6017526]
16:12:19.307 STDOUT terraform: module.storage.google_project_service.storage_googleapis_com: Creating...
16:12:19.307 STDOUT terraform: module.secretmanager.google_project_service.secretmanager_googleapis_com: Creating...
16:12:19.307 STDOUT terraform: module.storage.google_project_service.serviceusage_googleapis_com: Creating...
16:12:19.307 STDOUT terraform: module.storage.google_project_service.storage_component_googleapis_com: Creating...
16:12:19.308 STDOUT terraform: module.storage.google_project_service.storage_api_googleapis_com: Creating...
16:12:19.309 STDOUT terraform: module.storage.google_spanner_instance.log_spanner: Creating...
16:12:19.313 STDOUT terraform: module.storage.google_storage_bucket.log_bucket: Creating...
16:12:19.692 STDOUT terraform: module.storage.google_storage_bucket.log_bucket: Creation complete after 1s [id=transparency-dev-playground-ci-static-ct-bucket]
16:12:22.582 STDOUT terraform: module.storage.google_project_service.storage_component_googleapis_com: Creation complete after 4s [id=transparency-dev-playground/storage-component.googleapis.com]
16:12:22.582 STDOUT terraform: module.storage.google_project_service.serviceusage_googleapis_com: Creation complete after 4s [id=transparency-dev-playground/serviceusage.googleapis.com]
16:12:22.582 STDOUT terraform: module.secretmanager.google_project_service.secretmanager_googleapis_com: Creation complete after 4s [id=transparency-dev-playground/secretmanager.googleapis.com]
16:12:22.582 STDOUT terraform: module.storage.google_project_service.storage_api_googleapis_com: Creation complete after 4s [id=transparency-dev-playground/storage-api.googleapis.com]
16:12:22.582 STDOUT terraform: module.storage.google_project_service.storage_googleapis_com: Creation complete after 4s [id=transparency-dev-playground/storage.googleapis.com]
16:12:22.588 STDOUT terraform: module.secretmanager.google_secret_manager_secret.sctfe_ecdsa_p256_public_key: Creating...
16:12:22.590 STDOUT terraform: module.secretmanager.google_secret_manager_secret.sctfe_ecdsa_p256_private_key: Creating...
16:12:22.707 STDOUT terraform: module.secretmanager.google_secret_manager_secret.sctfe_ecdsa_p256_public_key: Creation complete after 0s [id=projects/transparency-dev-playground/secrets/ci-static-ct-ecdsa-p256-public-key]
16:12:22.709 STDOUT terraform: module.secretmanager.google_secret_manager_secret_version.sctfe_ecdsa_p256_public_key: Creating...
16:12:22.713 STDOUT terraform: module.secretmanager.google_secret_manager_secret.sctfe_ecdsa_p256_private_key: Creation complete after 0s [id=projects/transparency-dev-playground/secrets/ci-static-ct-ecdsa-p256-private-key]
16:12:22.716 STDOUT terraform: module.secretmanager.google_secret_manager_secret_version.sctfe_ecdsa_p256_private_key: Creating...
16:12:22.969 STDOUT terraform: module.secretmanager.google_secret_manager_secret_version.sctfe_ecdsa_p256_public_key: Creation complete after 0s [id=projects/828026317866/secrets/ci-static-ct-ecdsa-p256-public-key/versions/1]
16:12:23.044 STDOUT terraform: module.secretmanager.google_secret_manager_secret_version.sctfe_ecdsa_p256_private_key: Creation complete after 0s [id=projects/828026317866/secrets/ci-static-ct-ecdsa-p256-private-key/versions/1]
16:12:29.310 STDOUT terraform: module.storage.google_spanner_instance.log_spanner: Still creating... [10s elapsed]
16:12:34.759 STDOUT terraform: module.storage.google_spanner_instance.log_spanner: Creation complete after 16s [id=transparency-dev-playground/ci-static-ct]
16:12:34.764 STDOUT terraform: module.storage.google_spanner_database.dedup_db: Creating...
16:12:34.764 STDOUT terraform: module.storage.google_spanner_database.log_db: Creating...
16:12:44.764 STDOUT terraform: module.storage.google_spanner_database.dedup_db: Still creating... [10s elapsed]
16:12:44.765 STDOUT terraform: module.storage.google_spanner_database.log_db: Still creating... [10s elapsed]
16:12:54.765 STDOUT terraform: module.storage.google_spanner_database.dedup_db: Still creating... [20s elapsed]
16:12:54.766 STDOUT terraform: module.storage.google_spanner_database.log_db: Still creating... [20s elapsed]
16:13:04.766 STDOUT terraform: module.storage.google_spanner_database.dedup_db: Still creating... [30s elapsed]
16:13:04.766 STDOUT terraform: module.storage.google_spanner_database.log_db: Still creating... [30s elapsed]
16:13:14.767 STDOUT terraform: module.storage.google_spanner_database.log_db: Still creating... [40s elapsed]
16:13:14.768 STDOUT terraform: module.storage.google_spanner_database.dedup_db: Still creating... [40s elapsed]
16:13:16.291 STDOUT terraform: module.storage.google_spanner_database.dedup_db: Creation complete after 41s [id=ci-static-ct/ci-static-ct-dedup-db]
16:13:16.380 STDOUT terraform: module.storage.google_spanner_database.log_db: Creation complete after 41s [id=ci-static-ct/ci-static-ct-db]
16:13:16.384 STDOUT terraform: module.cloudrun.google_project_service.cloudrun_api: Creating...
16:13:19.694 STDOUT terraform: module.cloudrun.google_project_service.cloudrun_api: Creation complete after 4s [id=transparency-dev-playground/run.googleapis.com]
16:13:19.710 STDOUT terraform: module.cloudrun.google_cloud_run_v2_service.default: Creating...
16:13:29.711 STDOUT terraform: module.cloudrun.google_cloud_run_v2_service.default: Still creating... [10s elapsed]
16:13:39.712 STDOUT terraform: module.cloudrun.google_cloud_run_v2_service.default: Still creating... [20s elapsed]
16:13:49.713 STDOUT terraform: module.cloudrun.google_cloud_run_v2_service.default: Still creating... [30s elapsed]
16:13:59.714 STDOUT terraform: module.cloudrun.google_cloud_run_v2_service.default: Still creating... [40s elapsed]
16:14:09.715 STDOUT terraform: module.cloudrun.google_cloud_run_v2_service.default: Still creating... [50s elapsed]
16:14:19.716 STDOUT terraform: module.cloudrun.google_cloud_run_v2_service.default: Still creating... [1m0s elapsed]
16:14:20.585 STDOUT terraform: module.cloudrun.google_cloud_run_v2_service.default: Creation complete after 1m1s [id=projects/transparency-dev-playground/locations/us-central1/services/ci-static-ct]
16:14:20.881 STDOUT terraform: Apply complete! Resources: 16 added, 0 changed, 0 destroyed.
16:14:20.881 STDOUT terraform: Outputs:
16:14:20.881 STDOUT terraform: conformance_bucket_name = "transparency-dev-playground-ci-static-ct-bucket"
16:14:20.881 STDOUT terraform: conformance_url = "https://ci-static-ct-hprglv54za-uc.a.run.app"
16:14:20.881 STDOUT terraform: ecdsa_p256_private_key_id = "projects/828026317866/secrets/ci-static-ct-ecdsa-p256-private-key/versions/1"
16:14:20.881 STDOUT terraform: ecdsa_p256_public_key_id = "projects/828026317866/secrets/ci-static-ct-ecdsa-p256-public-key/versions/1"
16:14:20.882 STDOUT terraform: ecdsa_p256_public_key_secret_data = <sensitive>
16:14:20.943 WARN   Using `terragrunt.hcl` as the root of Terragrunt configurations is an anti-pattern, and no longer recommended. In a future version of Terragrunt, this will result in an error. You are advised to use a differently named file like `root.hcl` instead. For more information, see https://terragrunt.gruntwork.io/docs/migrate/migrating-from-root-terragrunt-hcl
16:14:21.812 WARN   Using `terragrunt.hcl` as the root of Terragrunt configurations is an anti-pattern, and no longer recommended. In a future version of Terragrunt, this will result in an error. You are advised to use a differently named file like `root.hcl` instead. For more information, see https://terragrunt.gruntwork.io/docs/migrate/migrating-from-root-terragrunt-hcl
16:14:22.625 WARN   Using `terragrunt.hcl` as the root of Terragrunt configurations is an anti-pattern, and no longer recommended. In a future version of Terragrunt, this will result in an error. You are advised to use a differently named file like `root.hcl` instead. For more information, see https://terragrunt.gruntwork.io/docs/migrate/migrating-from-root-terragrunt-hcl
Finished Step #4 - "terraform_apply_conformance_ci"
Starting Step #5 - "bearer_token"
Already have image (with digest): gcr.io/cloud-builders/gcloud
Get:4 http://deb.debian.org/debian bookworm/main amd64 Packages [8792 kB]
Get:5 http://deb.debian.org/debian bookworm-updates/main amd64 Packages [13.5 kB]
Get:6 http://deb.debian.org/debian-security bookworm-security/main amd64 Packages [246 kB]
Fetched 9306 kB in 2s (5710 kB/s)
Reading package lists...
Building dependency tree...
Reading state information...
3 packages can be upgraded. Run 'apt list --upgradable' to see them.
WARNING: apt does not have a stable CLI interface. Use with caution in scripts.
Reading package lists...
Building dependency tree...
Reading state information...
The following NEW packages will be installed:
  retry
0 upgraded, 1 newly installed, 0 to remove and 3 not upgraded.
Need to get 10.6 kB of archives.
After this operation, 37.9 kB of additional disk space will be used.
Get:1 http://deb.debian.org/debian bookworm/main amd64 retry amd64 1.0.5-3 [10.6 kB]
debconf: delaying package configuration, since apt-utils is not installed
Fetched 10.6 kB in 0s (294 kB/s)
Selecting previously unselected package retry.
(Reading database ... (Reading database ... 5%(Reading database ... 10%(Reading database ... 15%(Reading database ... 20%(Reading database ... 25%(Reading database ... 30%(Reading database ... 35%(Reading database ... 40%(Reading database ... 45%(Reading database ... 50%(Reading database ... 55%(Reading database ... 60%(Reading database ... 65%(Reading database ... 70%(Reading database ... 75%(Reading database ... 80%(Reading database ... 85%(Reading database ... 90%(Reading database ... 95%(Reading database ... 100%(Reading database ... 15612 files and directories currently installed.)
Preparing to unpack .../retry_1.0.5-3_amd64.deb ...
Unpacking retry (1.0.5-3) ...
Setting up retry (1.0.5-3) ...
read EC key
writing EC key
go: downloading github.com/transparency-dev/formats v0.0.0-20250127084410-134797944be6
go: downloading golang.org/x/mod v0.23.0
go: downloading k8s.io/klog/v2 v2.130.1
go: downloading golang.org/x/net v0.35.0
go: downloading github.com/transparency-dev/merkle v0.0.2
go: downloading github.com/transparency-dev/trillian-tessera v0.1.1-0.20250213171719-5f7ca097f44a
go: downloading github.com/RobinUS2/golang-moving-average v1.0.0
go: downloading github.com/gdamore/tcell/v2 v2.8.1
go: downloading github.com/rivo/tview v0.0.0-20240625185742-b0a7293b8130
go: downloading golang.org/x/crypto v0.34.0
go: downloading github.com/google/certificate-transparency-go v1.3.1
go: downloading github.com/go-logr/logr v1.4.2
go: downloading github.com/gdamore/encoding v1.0.1
go: downloading github.com/lucasb-eyer/go-colorful v1.2.0
go: downloading github.com/mattn/go-runewidth v0.0.16
go: downloading golang.org/x/sys v0.30.0
go: downloading golang.org/x/term v0.29.0
go: downloading golang.org/x/text v0.22.0
go: downloading github.com/rivo/uniseg v0.4.7
I0224 16:14:49.399838    2670 hammer.go:171] Will exit once tree size is at least 10000
I0224 16:14:58.099640    2670 hammer.go:110] Updated checkpoint from 0 to 1672
I0224 16:15:08.688537    2670 hammer.go:110] Updated checkpoint from 1672 to 3987
I0224 16:15:18.321850    2670 hammer.go:110] Updated checkpoint from 3987 to 6311
I0224 16:15:28.690553    2670 hammer.go:110] Updated checkpoint from 6311 to 8605
I0224 16:15:38.718416    2670 hammer.go:110] Updated checkpoint from 8605 to 10924
I0224 16:15:39.401920    2670 hammer.go:180] Reached tree size goal of 10000 after 50.002074355s; exiting
Finished Step #6 - "ct_hammer"
Starting Step #7 - "terraform_destroy_conformance_ci"
Already have image (with digest): alpine/terragrunt
16:15:40.241 WARN   Using `terragrunt.hcl` as the root of Terragrunt configurations is an anti-pattern, and no longer recommended. In a future version of Terragrunt, this will result in an error. You are advised to use a differently named file like `root.hcl` instead. For more information, see https://terragrunt.gruntwork.io/docs/migrate/migrating-from-root-terragrunt-hcl
16:15:41.843 STDOUT terraform: module.secretmanager.tls_private_key.sctfe_ecdsa_p256: Refreshing state... [id=52426d9cfafb769f86aa108b31bc550ba6017526]
16:15:41.996 STDOUT terraform: module.storage.google_project_service.storage_googleapis_com: Refreshing state... [id=transparency-dev-playground/storage.googleapis.com]
16:15:41.996 STDOUT terraform: module.storage.google_project_service.serviceusage_googleapis_com: Refreshing state... [id=transparency-dev-playground/serviceusage.googleapis.com]
16:15:41.996 STDOUT terraform: module.secretmanager.google_project_service.secretmanager_googleapis_com: Refreshing state... [id=transparency-dev-playground/secretmanager.googleapis.com]
16:15:41.996 STDOUT terraform: module.storage.google_project_service.storage_api_googleapis_com: Refreshing state... [id=transparency-dev-playground/storage-api.googleapis.com]
16:15:41.996 STDOUT terraform: module.storage.google_project_service.storage_component_googleapis_com: Refreshing state... [id=transparency-dev-playground/storage-component.googleapis.com]
16:15:41.996 STDOUT terraform: module.storage.google_spanner_instance.log_spanner: Refreshing state... [id=transparency-dev-playground/ci-static-ct]
16:15:41.998 STDOUT terraform: module.storage.google_storage_bucket.log_bucket: Refreshing state... [id=transparency-dev-playground-ci-static-ct-bucket]
16:15:42.059 STDOUT terraform: module.storage.google_spanner_database.dedup_db: Refreshing state... [id=ci-static-ct/ci-static-ct-dedup-db]
16:15:42.059 STDOUT terraform: module.storage.google_spanner_database.log_db: Refreshing state... [id=ci-static-ct/ci-static-ct-db]
16:15:45.341 STDOUT terraform: module.secretmanager.google_secret_manager_secret.sctfe_ecdsa_p256_private_key: Refreshing state... [id=projects/transparency-dev-playground/secrets/ci-static-ct-ecdsa-p256-private-key]
16:15:45.342 STDOUT terraform: module.secretmanager.google_secret_manager_secret.sctfe_ecdsa_p256_public_key: Refreshing state... [id=projects/transparency-dev-playground/secrets/ci-static-ct-ecdsa-p256-public-key]
16:15:45.395 STDOUT terraform: module.secretmanager.google_secret_manager_secret_version.sctfe_ecdsa_p256_public_key: Refreshing state... [id=projects/828026317866/secrets/ci-static-ct-ecdsa-p256-public-key/versions/1]
16:15:45.401 STDOUT terraform: module.secretmanager.google_secret_manager_secret_version.sctfe_ecdsa_p256_private_key: Refreshing state... [id=projects/828026317866/secrets/ci-static-ct-ecdsa-p256-private-key/versions/1]
16:15:45.496 STDOUT terraform: module.cloudrun.google_project_service.cloudrun_api: Refreshing state... [id=transparency-dev-playground/run.googleapis.com]
16:15:48.806 STDOUT terraform: module.cloudrun.google_cloud_run_v2_service.default: Refreshing state... [id=projects/transparency-dev-playground/locations/us-central1/services/ci-static-ct]
16:15:49.236 STDOUT terraform: Terraform used the selected providers to generate the following execution
16:15:49.236 STDOUT terraform: plan. Resource actions are indicated with the following symbols:
16:15:49.236 STDOUT terraform:   - destroy
16:15:49.236 STDOUT terraform: Terraform will perform the following actions:
16:15:49.237 STDOUT terraform:   # module.cloudrun.google_cloud_run_v2_service.default will be destroyed
16:15:49.237 STDOUT terraform:   - resource "google_cloud_run_v2_service" "default" {
16:15:49.237 STDOUT terraform:       - annotations             = {} -> null
16:15:49.237 STDOUT terraform:       - client                  = "terraform" -> null
16:15:49.237 STDOUT terraform:       - conditions              = [
16:15:49.237 STDOUT terraform:           - {
16:15:49.237 STDOUT terraform:               - last_transition_time = "2025-02-24T16:14:18.779653Z"
16:15:49.237 STDOUT terraform:               - state                = "CONDITION_SUCCEEDED"
16:15:49.237 STDOUT terraform:               - type                 = "RoutesReady"
16:15:49.237 STDOUT terraform:                 # (5 unchanged attributes hidden)
16:15:49.237 STDOUT terraform:             },
16:15:49.237 STDOUT terraform:           - {
16:15:49.237 STDOUT terraform:               - last_transition_time = "2025-02-24T16:14:15.378081Z"
16:15:49.237 STDOUT terraform:               - state                = "CONDITION_SUCCEEDED"
16:15:49.237 STDOUT terraform:               - type                 = "ConfigurationsReady"
16:15:49.237 STDOUT terraform:                 # (5 unchanged attributes hidden)
16:15:49.237 STDOUT terraform:             },
16:15:49.237 STDOUT terraform:         ] -> null
16:15:49.237 STDOUT terraform:       - create_time             = "2025-02-24T16:13:19.843322Z" -> null
16:15:49.238 STDOUT terraform:       - creator                 = "cloudbuild-prod-sa@transparency-dev-playground.iam.gserviceaccount.com" -> null
16:15:49.238 STDOUT terraform:       - custom_audiences        = [] -> null
16:15:49.238 STDOUT terraform:       - deletion_protection     = false -> null
16:15:49.238 STDOUT terraform:       - effective_annotations   = {} -> null
16:15:49.238 STDOUT terraform:       - effective_labels        = {
16:15:49.238 STDOUT terraform:           - "goog-terraform-provisioned" = "true"
16:15:49.238 STDOUT terraform:         } -> null
16:15:49.238 STDOUT terraform:       - etag                    = "\"CJ-18r0GEJClkJID/cHJvamVjdHMvdHJhbnNwYXJlbmN5LWRldi1wbGF5Z3JvdW5kL2xvY2F0aW9ucy91cy1jZW50cmFsMS9zZXJ2aWNlcy9jaS1zdGF0aWMtY3Q\"" -> null
16:15:49.238 STDOUT terraform:       - generation              = "1" -> null
16:15:49.238 STDOUT terraform:       - id                      = "projects/transparency-dev-playground/locations/us-central1/services/ci-static-ct" -> null
16:15:49.238 STDOUT terraform:       - ingress                 = "INGRESS_TRAFFIC_ALL" -> null
16:15:49.238 STDOUT terraform:       - invoker_iam_disabled    = false -> null
16:15:49.238 STDOUT terraform:       - labels                  = {} -> null
16:15:49.238 STDOUT terraform:       - last_modifier           = "cloudbuild-prod-sa@transparency-dev-playground.iam.gserviceaccount.com" -> null
16:15:49.238 STDOUT terraform:       - latest_created_revision = "projects/transparency-dev-playground/locations/us-central1/services/ci-static-ct/revisions/ci-static-ct-00001-d9r" -> null
16:15:49.239 STDOUT terraform:       - latest_ready_revision   = "projects/transparency-dev-playground/locations/us-central1/services/ci-static-ct/revisions/ci-static-ct-00001-d9r" -> null
16:15:49.239 STDOUT terraform:       - launch_stage            = "GA" -> null
16:15:49.239 STDOUT terraform:       - location                = "us-central1" -> null
16:15:49.239 STDOUT terraform:       - name                    = "ci-static-ct" -> null
16:15:49.239 STDOUT terraform:       - observed_generation     = "1" -> null
16:15:49.239 STDOUT terraform:       - project                 = "transparency-dev-playground" -> null
16:15:49.239 STDOUT terraform:       - reconciling             = false -> null
16:15:49.239 STDOUT terraform:       - terminal_condition      = [
16:15:49.239 STDOUT terraform:           - {
16:15:49.239 STDOUT terraform:               - last_transition_time = "2025-02-24T16:14:18.816144Z"
16:15:49.239 STDOUT terraform:               - state                = "CONDITION_SUCCEEDED"
16:15:49.239 STDOUT terraform:               - type                 = "Ready"
16:15:49.239 STDOUT terraform:                 # (5 unchanged attributes hidden)
16:15:49.239 STDOUT terraform:             },
16:15:49.239 STDOUT terraform:         ] -> null
16:15:49.239 STDOUT terraform:       - terraform_labels        = {
16:15:49.239 STDOUT terraform:           - "goog-terraform-provisioned" = "true"
16:15:49.239 STDOUT terraform:         } -> null
16:15:49.239 STDOUT terraform:       - traffic_statuses        = [
16:15:49.239 STDOUT terraform:           - {
16:15:49.240 STDOUT terraform:               - percent  = 100
16:15:49.240 STDOUT terraform:               - type     = "TRAFFIC_TARGET_ALLOCATION_TYPE_LATEST"
16:15:49.240 STDOUT terraform:                 # (3 unchanged attributes hidden)
16:15:49.240 STDOUT terraform:             },
16:15:49.240 STDOUT terraform:         ] -> null
16:15:49.240 STDOUT terraform:       - uid                     = "db8c190f-0907-4a08-8db6-bdd90680c240" -> null
16:15:49.240 STDOUT terraform:       - update_time             = "2025-02-24T16:13:19.843322Z" -> null
16:15:49.240 STDOUT terraform:       - uri                     = "https://ci-static-ct-hprglv54za-uc.a.run.app" -> null
16:15:49.240 STDOUT terraform:       - urls                    = [
16:15:49.240 STDOUT terraform:           - "https://ci-static-ct-828026317866.us-central1.run.app",
16:15:49.240 STDOUT terraform:           - "https://ci-static-ct-hprglv54za-uc.a.run.app",
16:15:49.240 STDOUT terraform:         ] -> null
16:15:49.240 STDOUT terraform:         # (4 unchanged attributes hidden)
16:15:49.240 STDOUT terraform:       - template {
16:15:49.240 STDOUT terraform:           - annotations                      = {} -> null
16:15:49.240 STDOUT terraform:           - labels                           = {} -> null
16:15:49.240 STDOUT terraform:           - max_instance_request_concurrency = 700 -> null
16:15:49.240 STDOUT terraform:           - service_account                  = "cloudrun-ci-sa@transparency-dev-playground.iam.gserviceaccount.com" -> null
16:15:49.241 STDOUT terraform:           - session_affinity                 = false -> null
16:15:49.241 STDOUT terraform:           - timeout                          = "5s" -> null
16:15:49.241 STDOUT terraform:             # (3 unchanged attributes hidden)
16:15:49.241 STDOUT terraform:           - containers {
16:15:49.241 STDOUT terraform:               - args        = [
16:15:49.241 STDOUT terraform:                   - "--logtostderr",
16:15:49.241 STDOUT terraform:                   - "--v=1",
16:15:49.241 STDOUT terraform:                   - "--http_endpoint=:6962",
16:15:49.241 STDOUT terraform:                   - "--bucket=transparency-dev-playground-ci-static-ct-bucket",
16:15:49.241 STDOUT terraform:                   - "--spanner_db_path=projects/transparency-dev-playground/instances/ci-static-ct/databases/ci-static-ct-db",
16:15:49.241 STDOUT terraform:                   - "--spanner_dedup_db_path=projects/transparency-dev-playground/instances/ci-static-ct/databases/ci-static-ct-dedup-db",
16:15:49.241 STDOUT terraform:                   - "--roots_pem_file=/bin/test_root_ca_cert.pem",
16:15:49.241 STDOUT terraform:                   - "--origin=ci-static-ct",
16:15:49.241 STDOUT terraform:                   - "--signer_public_key_secret_name=projects/828026317866/secrets/ci-static-ct-ecdsa-p256-public-key/versions/1",
16:15:49.241 STDOUT terraform:                   - "--signer_private_key_secret_name=projects/828026317866/secrets/ci-static-ct-ecdsa-p256-private-key/versions/1",
16:15:49.242 STDOUT terraform:                 ] -> null
16:15:49.242 STDOUT terraform:               - command     = [] -> null
16:15:49.242 STDOUT terraform:               - depends_on  = [] -> null
16:15:49.242 STDOUT terraform:               - image       = "us-central1-docker.pkg.dev/transparency-dev-playground/docker-ci/conformance-gcp:latest" -> null
16:15:49.242 STDOUT terraform:               - name        = "conformance" -> null
16:15:49.242 STDOUT terraform:                 # (1 unchanged attribute hidden)
16:15:49.242 STDOUT terraform:               - ports {
16:15:49.242 STDOUT terraform:                   - container_port = 6962 -> null
16:15:49.242 STDOUT terraform:                   - name           = "http1" -> null
16:15:49.242 STDOUT terraform:                 }
16:15:49.242 STDOUT terraform:               - resources {
16:15:49.242 STDOUT terraform:                   - cpu_idle          = false -> null
16:15:49.242 STDOUT terraform:                   - limits            = {
16:15:49.242 STDOUT terraform:                       - "cpu"    = "2000m"
16:15:49.242 STDOUT terraform:                       - "memory" = "1Gi"
16:15:49.242 STDOUT terraform:                     } -> null
16:15:49.242 STDOUT terraform:                   - startup_cpu_boost = false -> null
16:15:49.242 STDOUT terraform:                 }
16:15:49.242 STDOUT terraform:               - startup_probe {
16:15:49.242 STDOUT terraform:                   - failure_threshold     = 6 -> null
16:15:49.243 STDOUT terraform:                   - initial_delay_seconds = 1 -> null
16:15:49.243 STDOUT terraform:                   - period_seconds        = 10 -> null
16:15:49.243 STDOUT terraform:                   - timeout_seconds       = 1 -> null
16:15:49.243 STDOUT terraform:                   - tcp_socket {
16:15:49.243 STDOUT terraform:                       - port = 6962 -> null
16:15:49.243 STDOUT terraform:                     }
16:15:49.243 STDOUT terraform:                 }
16:15:49.243 STDOUT terraform:             }
16:15:49.243 STDOUT terraform:           - scaling {
16:15:49.243 STDOUT terraform:               - max_instance_count = 3 -> null
16:15:49.243 STDOUT terraform:               - min_instance_count = 0 -> null
16:15:49.243 STDOUT terraform:             }
16:15:49.243 STDOUT terraform:         }
16:15:49.243 STDOUT terraform:       - traffic {
16:15:49.243 STDOUT terraform:           - percent  = 100 -> null
16:15:49.243 STDOUT terraform:           - type     = "TRAFFIC_TARGET_ALLOCATION_TYPE_LATEST" -> null
16:15:49.243 STDOUT terraform:             # (2 unchanged attributes hidden)
16:15:49.243 STDOUT terraform:         }
16:15:49.243 STDOUT terraform:     }
16:15:49.243 STDOUT terraform:   # module.cloudrun.google_project_service.cloudrun_api will be destroyed
16:15:49.243 STDOUT terraform:   - resource "google_project_service" "cloudrun_api" {
16:15:49.243 STDOUT terraform:       - disable_on_destroy = false -> null
16:15:49.243 STDOUT terraform:       - id                 = "transparency-dev-playground/run.googleapis.com" -> null
16:15:49.244 STDOUT terraform:       - project            = "transparency-dev-playground" -> null
16:15:49.244 STDOUT terraform:       - service            = "run.googleapis.com" -> null
16:15:49.244 STDOUT terraform:     }
16:15:49.244 STDOUT terraform:   # module.secretmanager.google_project_service.secretmanager_googleapis_com will be destroyed
16:15:49.244 STDOUT terraform:   - resource "google_project_service" "secretmanager_googleapis_com" {
16:15:49.244 STDOUT terraform:       - disable_on_destroy = false -> null
16:15:49.244 STDOUT terraform:       - id                 = "transparency-dev-playground/secretmanager.googleapis.com" -> null
16:15:49.244 STDOUT terraform:       - project            = "transparency-dev-playground" -> null
16:15:49.244 STDOUT terraform:       - service            = "secretmanager.googleapis.com" -> null
16:15:49.244 STDOUT terraform:     }
16:15:49.244 STDOUT terraform:   # module.secretmanager.google_secret_manager_secret.sctfe_ecdsa_p256_private_key will be destroyed
16:15:49.244 STDOUT terraform:   - resource "google_secret_manager_secret" "sctfe_ecdsa_p256_private_key" {
16:15:49.244 STDOUT terraform:       - annotations           = {} -> null
16:15:49.244 STDOUT terraform:       - create_time           = "2025-02-24T16:12:22.670748Z" -> null
16:15:49.244 STDOUT terraform:       - effective_annotations = {} -> null
16:15:49.244 STDOUT terraform:       - effective_labels      = {
16:15:49.245 STDOUT terraform:           - "goog-terraform-provisioned" = "true"
16:15:49.245 STDOUT terraform:           - "label"                      = "sctfe-private-key"
16:15:49.245 STDOUT terraform:         } -> null
16:15:49.245 STDOUT terraform:       - id                    = "projects/transparency-dev-playground/secrets/ci-static-ct-ecdsa-p256-private-key" -> null
16:15:49.245 STDOUT terraform:       - labels                = {
16:15:49.245 STDOUT terraform:           - "label" = "sctfe-private-key"
16:15:49.245 STDOUT terraform:         } -> null
16:15:49.245 STDOUT terraform:       - name                  = "projects/828026317866/secrets/ci-static-ct-ecdsa-p256-private-key" -> null
16:15:49.245 STDOUT terraform:       - project               = "transparency-dev-playground" -> null
16:15:49.245 STDOUT terraform:       - secret_id             = "ci-static-ct-ecdsa-p256-private-key" -> null
16:15:49.245 STDOUT terraform:       - terraform_labels      = {
16:15:49.245 STDOUT terraform:           - "goog-terraform-provisioned" = "true"
16:15:49.245 STDOUT terraform:           - "label"                      = "sctfe-private-key"
16:15:49.245 STDOUT terraform:         } -> null
16:15:49.245 STDOUT terraform:       - version_aliases       = {} -> null
16:15:49.245 STDOUT terraform:         # (2 unchanged attributes hidden)
16:15:49.245 STDOUT terraform:       - replication {
16:15:49.245 STDOUT terraform:           - auto {
16:15:49.245 STDOUT terraform:             }
16:15:49.245 STDOUT terraform:         }
16:15:49.246 STDOUT terraform:     }
16:15:49.246 STDOUT terraform:   # module.secretmanager.google_secret_manager_secret.sctfe_ecdsa_p256_public_key will be destroyed
16:15:49.246 STDOUT terraform:   - resource "google_secret_manager_secret" "sctfe_ecdsa_p256_public_key" {
16:15:49.246 STDOUT terraform:       - annotations           = {} -> null
16:15:49.246 STDOUT terraform:       - create_time           = "2025-02-24T16:12:22.663654Z" -> null
16:15:49.246 STDOUT terraform:       - effective_annotations = {} -> null
16:15:49.246 STDOUT terraform:       - effective_labels      = {
16:15:49.246 STDOUT terraform:           - "goog-terraform-provisioned" = "true"
16:15:49.246 STDOUT terraform:           - "label"                      = "sctfe-public-key"
16:15:49.246 STDOUT terraform:         } -> null
16:15:49.246 STDOUT terraform:       - id                    = "projects/transparency-dev-playground/secrets/ci-static-ct-ecdsa-p256-public-key" -> null
16:15:49.246 STDOUT terraform:       - labels                = {
16:15:49.246 STDOUT terraform:           - "label" = "sctfe-public-key"
16:15:49.246 STDOUT terraform:         } -> null
16:15:49.246 STDOUT terraform:       - name                  = "projects/828026317866/secrets/ci-static-ct-ecdsa-p256-public-key" -> null
16:15:49.246 STDOUT terraform:       - project               = "transparency-dev-playground" -> null
16:15:49.246 STDOUT terraform:       - secret_id             = "ci-static-ct-ecdsa-p256-public-key" -> null
16:15:49.247 STDOUT terraform:       - terraform_labels      = {
16:15:49.247 STDOUT terraform:           - "goog-terraform-provisioned" = "true"
16:15:49.247 STDOUT terraform:           - "label"                      = "sctfe-public-key"
16:15:49.247 STDOUT terraform:         } -> null
16:15:49.247 STDOUT terraform:       - version_aliases       = {} -> null
16:15:49.247 STDOUT terraform:         # (2 unchanged attributes hidden)
16:15:49.247 STDOUT terraform:       - replication {
16:15:49.247 STDOUT terraform:           - auto {
16:15:49.247 STDOUT terraform:             }
16:15:49.247 STDOUT terraform:         }
16:15:49.247 STDOUT terraform:     }
16:15:49.247 STDOUT terraform:   # module.secretmanager.google_secret_manager_secret_version.sctfe_ecdsa_p256_private_key will be destroyed
16:15:49.247 STDOUT terraform:   - resource "google_secret_manager_secret_version" "sctfe_ecdsa_p256_private_key" {
16:15:49.247 STDOUT terraform:       - create_time           = "2025-02-24T16:12:22.872705Z" -> null
16:15:49.247 STDOUT terraform:       - deletion_policy       = "DELETE" -> null
16:15:49.247 STDOUT terraform:       - enabled               = true -> null
16:15:49.247 STDOUT terraform:       - id                    = "projects/828026317866/secrets/ci-static-ct-ecdsa-p256-private-key/versions/1" -> null
16:15:49.248 STDOUT terraform:       - is_secret_data_base64 = false -> null
16:15:49.248 STDOUT terraform:       - name                  = "projects/828026317866/secrets/ci-static-ct-ecdsa-p256-private-key/versions/1" -> null
16:15:49.248 STDOUT terraform:       - secret                = "projects/transparency-dev-playground/secrets/ci-static-ct-ecdsa-p256-private-key" -> null
16:15:49.248 STDOUT terraform:       - secret_data           = (sensitive value) -> null
16:15:49.248 STDOUT terraform:       - version               = "1" -> null
16:15:49.248 STDOUT terraform:         # (1 unchanged attribute hidden)
16:15:49.248 STDOUT terraform:     }
16:15:49.248 STDOUT terraform:   # module.secretmanager.google_secret_manager_secret_version.sctfe_ecdsa_p256_public_key will be destroyed
16:15:49.248 STDOUT terraform:   - resource "google_secret_manager_secret_version" "sctfe_ecdsa_p256_public_key" {
16:15:49.248 STDOUT terraform:       - create_time           = "2025-02-24T16:12:22.839174Z" -> null
16:15:49.248 STDOUT terraform:       - deletion_policy       = "DELETE" -> null
16:15:49.248 STDOUT terraform:       - enabled               = true -> null
16:15:49.248 STDOUT terraform:       - id                    = "projects/828026317866/secrets/ci-static-ct-ecdsa-p256-public-key/versions/1" -> null
16:15:49.248 STDOUT terraform:       - is_secret_data_base64 = false -> null
16:15:49.248 STDOUT terraform:       - name                  = "projects/828026317866/secrets/ci-static-ct-ecdsa-p256-public-key/versions/1" -> null
16:15:49.249 STDOUT terraform:       - secret                = "projects/transparency-dev-playground/secrets/ci-static-ct-ecdsa-p256-public-key" -> null
16:15:49.249 STDOUT terraform:       - secret_data           = (sensitive value) -> null
16:15:49.249 STDOUT terraform:       - version               = "1" -> null
16:15:49.249 STDOUT terraform:         # (1 unchanged attribute hidden)
16:15:49.249 STDOUT terraform:     }
16:15:49.249 STDOUT terraform:   # module.secretmanager.tls_private_key.sctfe_ecdsa_p256 will be destroyed
16:15:49.249 STDOUT terraform:   - resource "tls_private_key" "sctfe_ecdsa_p256" {
16:15:49.249 STDOUT terraform:       - algorithm                     = "ECDSA" -> null
16:15:49.249 STDOUT terraform:       - ecdsa_curve                   = "P256" -> null
16:15:49.249 STDOUT terraform:       - id                            = "52426d9cfafb769f86aa108b31bc550ba6017526" -> null
16:15:49.249 STDOUT terraform:       - private_key_openssh           = (sensitive value) -> null
16:15:49.249 STDOUT terraform:       - private_key_pem               = (sensitive value) -> null
16:15:49.249 STDOUT terraform:       - private_key_pem_pkcs8         = (sensitive value) -> null
16:15:49.249 STDOUT terraform:       - public_key_fingerprint_md5    = "62:f3:5f:bb:36:97:a4:65:a9:9b:ff:db:9c:a2:f3:ed" -> null
16:15:49.250 STDOUT terraform:       - public_key_fingerprint_sha256 = "SHA256:T6Sg+VxMVIEg7viavpB+ELiBuCaYHZp/jvuMZZyp+z0" -> null
16:15:49.250 STDOUT terraform:       - public_key_openssh            = <<-EOT
16:15:49.250 STDOUT terraform:             ecdsa-sha2-nistp256 AAAAE2VjZHNhLXNoYTItbmlzdHAyNTYAAAAIbmlzdHAyNTYAAABBBPL2nTXZDOWsLrwuUeppDf+GkAxXUv1/DPFE3jyupkSO7VbkGaekaQU2cRdKBe/bWTxcQvS3AwQUag3Wax0BrI4=
16:15:49.250 STDOUT terraform:         EOT -> null
16:15:49.250 STDOUT terraform:       - public_key_pem                = <<-EOT
16:15:49.250 STDOUT terraform:             -----BEGIN PUBLIC KEY-----
16:15:49.250 STDOUT terraform:             MFkwEwYHKoZIzj0CAQYIKoZIzj0DAQcDQgAE8vadNdkM5awuvC5R6mkN/4aQDFdS
16:15:49.250 STDOUT terraform:             /X8M8UTePK6mRI7tVuQZp6RpBTZxF0oF79tZPFxC9LcDBBRqDdZrHQGsjg==
16:15:49.250 STDOUT terraform:             -----END PUBLIC KEY-----
16:15:49.250 STDOUT terraform:         EOT -> null
16:15:49.250 STDOUT terraform:       - rsa_bits                      = 2048 -> null
16:15:49.250 STDOUT terraform:     }
16:15:49.250 STDOUT terraform:   # module.storage.google_project_service.serviceusage_googleapis_com will be destroyed
16:15:49.250 STDOUT terraform:   - resource "google_project_service" "serviceusage_googleapis_com" {
16:15:49.250 STDOUT terraform:       - disable_on_destroy = false -> null
16:15:49.251 STDOUT terraform:       - id                 = "transparency-dev-playground/serviceusage.googleapis.com" -> null
16:15:49.251 STDOUT terraform:       - project            = "transparency-dev-playground" -> null
16:15:49.251 STDOUT terraform:       - service            = "serviceusage.googleapis.com" -> null
16:15:49.251 STDOUT terraform:     }
16:15:49.251 STDOUT terraform:   # module.storage.google_project_service.storage_api_googleapis_com will be destroyed
16:15:49.251 STDOUT terraform:   - resource "google_project_service" "storage_api_googleapis_com" {
16:15:49.251 STDOUT terraform:       - disable_on_destroy = false -> null
16:15:49.251 STDOUT terraform:       - id                 = "transparency-dev-playground/storage-api.googleapis.com" -> null
16:15:49.251 STDOUT terraform:       - project            = "transparency-dev-playground" -> null
16:15:49.251 STDOUT terraform:       - service            = "storage-api.googleapis.com" -> null
16:15:49.251 STDOUT terraform:     }
16:15:49.251 STDOUT terraform:   # module.storage.google_project_service.storage_component_googleapis_com will be destroyed
16:15:49.251 STDOUT terraform:   - resource "google_project_service" "storage_component_googleapis_com" {
16:15:49.251 STDOUT terraform:       - disable_on_destroy = false -> null
16:15:49.251 STDOUT terraform:       - id                 = "transparency-dev-playground/storage-component.googleapis.com" -> null
16:15:49.252 STDOUT terraform:       - project            = "transparency-dev-playground" -> null
16:15:49.252 STDOUT terraform:       - service            = "storage-component.googleapis.com" -> null
16:15:49.252 STDOUT terraform:     }
16:15:49.252 STDOUT terraform:   # module.storage.google_project_service.storage_googleapis_com will be destroyed
16:15:49.252 STDOUT terraform:   - resource "google_project_service" "storage_googleapis_com" {
16:15:49.252 STDOUT terraform:       - disable_on_destroy = false -> null
16:15:49.252 STDOUT terraform:       - id                 = "transparency-dev-playground/storage.googleapis.com" -> null
16:15:49.252 STDOUT terraform:       - project            = "transparency-dev-playground" -> null
16:15:49.252 STDOUT terraform:       - service            = "storage.googleapis.com" -> null
16:15:49.252 STDOUT terraform:     }
16:15:49.252 STDOUT terraform:   # module.storage.google_spanner_database.dedup_db will be destroyed
16:15:49.252 STDOUT terraform:   - resource "google_spanner_database" "dedup_db" {
16:15:49.252 STDOUT terraform:       - database_dialect         = "GOOGLE_STANDARD_SQL" -> null
16:15:49.252 STDOUT terraform:       - ddl                      = [
16:15:49.252 STDOUT terraform:           - "CREATE TABLE IDSeq (id INT64 NOT NULL, h BYTES(MAX) NOT NULL, idx INT64 NOT NULL, timestamp INT64 NOT NULL,) PRIMARY KEY (id, h)",
16:15:49.253 STDOUT terraform:         ] -> null
16:15:49.253 STDOUT terraform:       - deletion_protection      = false -> null
16:15:49.253 STDOUT terraform:       - enable_drop_protection   = false -> null
16:15:49.253 STDOUT terraform:       - id                       = "ci-static-ct/ci-static-ct-dedup-db" -> null
16:15:49.253 STDOUT terraform:       - instance                 = "ci-static-ct" -> null
16:15:49.253 STDOUT terraform:       - name                     = "ci-static-ct-dedup-db" -> null
16:15:49.253 STDOUT terraform:       - project                  = "transparency-dev-playground" -> null
16:15:49.253 STDOUT terraform:       - state                    = "READY" -> null
16:15:49.253 STDOUT terraform:       - version_retention_period = "1h" -> null
16:15:49.253 STDOUT terraform:     }
16:15:49.253 STDOUT terraform:   # module.storage.google_spanner_database.log_db will be destroyed
16:15:49.253 STDOUT terraform:   - resource "google_spanner_database" "log_db" {
16:15:49.253 STDOUT terraform:       - database_dialect         = "GOOGLE_STANDARD_SQL" -> null
16:15:49.253 STDOUT terraform:       - ddl                      = [
16:15:49.253 STDOUT terraform:           - "CREATE TABLE IF NOT EXISTS Tessera (id INT64 NOT NULL, compatibilityVersion INT64 NOT NULL) PRIMARY KEY (id)",
16:15:49.253 STDOUT terraform:           - "CREATE TABLE IF NOT EXISTS SeqCoord (id INT64 NOT NULL, next INT64 NOT NULL,) PRIMARY KEY (id)",
16:15:49.254 STDOUT terraform:           - "CREATE TABLE IF NOT EXISTS Seq (id INT64 NOT NULL, seq INT64 NOT NULL, v BYTES(MAX),) PRIMARY KEY (id, seq)",
16:15:49.254 STDOUT terraform:           - "CREATE TABLE IF NOT EXISTS IntCoord (id INT64 NOT NULL, seq INT64 NOT NULL, rootHash BYTES(32)) PRIMARY KEY (id)",
16:15:49.254 STDOUT terraform:         ] -> null
16:15:49.254 STDOUT terraform:       - deletion_protection      = false -> null
16:15:49.254 STDOUT terraform:       - enable_drop_protection   = false -> null
16:15:49.254 STDOUT terraform:       - id                       = "ci-static-ct/ci-static-ct-db" -> null
16:15:49.254 STDOUT terraform:       - instance                 = "ci-static-ct" -> null
16:15:49.254 STDOUT terraform:       - name                     = "ci-static-ct-db" -> null
16:15:49.254 STDOUT terraform:       - project                  = "transparency-dev-playground" -> null
16:15:49.254 STDOUT terraform:       - state                    = "READY" -> null
16:15:49.254 STDOUT terraform:       - version_retention_period = "1h" -> null
16:15:49.254 STDOUT terraform:     }
16:15:49.254 STDOUT terraform:   # module.storage.google_spanner_instance.log_spanner will be destroyed
16:15:49.254 STDOUT terraform:   - resource "google_spanner_instance" "log_spanner" {
16:15:49.255 STDOUT terraform:       - config                       = "projects/transparency-dev-playground/instanceConfigs/regional-us-central1" -> null
16:15:49.255 STDOUT terraform:       - default_backup_schedule_type = "NONE" -> null
16:15:49.255 STDOUT terraform:       - display_name                 = "ci-static-ct" -> null
16:15:49.255 STDOUT terraform:       - edition                      = "STANDARD" -> null
16:15:49.255 STDOUT terraform:       - effective_labels             = {
16:15:49.255 STDOUT terraform:           - "goog-terraform-provisioned" = "true"
16:15:49.255 STDOUT terraform:         } -> null
16:15:49.255 STDOUT terraform:       - force_destroy                = true -> null
16:15:49.255 STDOUT terraform:       - id                           = "transparency-dev-playground/ci-static-ct" -> null
16:15:49.255 STDOUT terraform:       - labels                       = {} -> null
16:15:49.255 STDOUT terraform:       - name                         = "ci-static-ct" -> null
16:15:49.255 STDOUT terraform:       - num_nodes                    = 0 -> null
16:15:49.255 STDOUT terraform:       - processing_units             = 100 -> null
16:15:49.255 STDOUT terraform:       - project                      = "transparency-dev-playground" -> null
16:15:49.255 STDOUT terraform:       - state                        = "READY" -> null
16:15:49.255 STDOUT terraform:       - terraform_labels             = {
16:15:49.256 STDOUT terraform:           - "goog-terraform-provisioned" = "true"
16:15:49.256 STDOUT terraform:         } -> null
16:15:49.256 STDOUT terraform:     }
16:15:49.256 STDOUT terraform:   # module.storage.google_storage_bucket.log_bucket will be destroyed
16:15:49.256 STDOUT terraform:   - resource "google_storage_bucket" "log_bucket" {
16:15:49.256 STDOUT terraform:       - default_event_based_hold    = false -> null
16:15:49.256 STDOUT terraform:       - effective_labels            = {
16:15:49.256 STDOUT terraform:           - "goog-terraform-provisioned" = "true"
16:15:49.256 STDOUT terraform:         } -> null
16:15:49.256 STDOUT terraform:       - enable_object_retention     = false -> null
16:15:49.256 STDOUT terraform:       - force_destroy               = true -> null
16:15:49.256 STDOUT terraform:       - id                          = "transparency-dev-playground-ci-static-ct-bucket" -> null
16:15:49.256 STDOUT terraform:       - labels                      = {} -> null
16:15:49.256 STDOUT terraform:       - location                    = "US-CENTRAL1" -> null
16:15:49.256 STDOUT terraform:       - name                        = "transparency-dev-playground-ci-static-ct-bucket" -> null
16:15:49.256 STDOUT terraform:       - project                     = "transparency-dev-playground" -> null
16:15:49.256 STDOUT terraform:       - project_number              = 828026317866 -> null
16:15:49.256 STDOUT terraform:       - public_access_prevention    = "inherited" -> null
16:15:49.257 STDOUT terraform:       - requester_pays              = false -> null
16:15:49.257 STDOUT terraform:       - self_link                   = "https://www.googleapis.com/storage/v1/b/transparency-dev-playground-ci-static-ct-bucket" -> null
16:15:49.257 STDOUT terraform:       - storage_class               = "STANDARD" -> null
16:15:49.257 STDOUT terraform:       - terraform_labels            = {
16:15:49.257 STDOUT terraform:           - "goog-terraform-provisioned" = "true"
16:15:49.257 STDOUT terraform:         } -> null
16:15:49.257 STDOUT terraform:       - uniform_bucket_level_access = true -> null
16:15:49.257 STDOUT terraform:       - url                         = "gs://transparency-dev-playground-ci-static-ct-bucket" -> null
16:15:49.258 STDOUT terraform:       - hierarchical_namespace {
16:15:49.258 STDOUT terraform:           - enabled = false -> null
16:15:49.258 STDOUT terraform:         }
16:15:49.258 STDOUT terraform:       - soft_delete_policy {
16:15:49.258 STDOUT terraform:           - effective_time             = "2025-02-24T16:12:19.603Z" -> null
16:15:49.258 STDOUT terraform:           - retention_duration_seconds = 604800 -> null
16:15:49.258 STDOUT terraform:         }
16:15:49.258 STDOUT terraform:     }
16:15:49.258 STDOUT terraform: Plan: 0 to add, 0 to change, 16 to destroy.
16:15:49.259 STDOUT terraform: Changes to Outputs:
16:15:49.259 STDOUT terraform:   - conformance_bucket_name           = "transparency-dev-playground-ci-static-ct-bucket" -> null
16:15:49.259 STDOUT terraform:   - conformance_url                   = "https://ci-static-ct-hprglv54za-uc.a.run.app" -> null
16:15:49.259 STDOUT terraform:   - ecdsa_p256_private_key_id         = "projects/828026317866/secrets/ci-static-ct-ecdsa-p256-private-key/versions/1" -> null
16:15:49.259 STDOUT terraform:   - ecdsa_p256_public_key_id          = "projects/828026317866/secrets/ci-static-ct-ecdsa-p256-public-key/versions/1" -> null
16:15:49.259 STDOUT terraform:   - ecdsa_p256_public_key_secret_data = (sensitive value) -> null
16:15:49.544 STDOUT terraform: module.cloudrun.google_cloud_run_v2_service.default: Destroying... [id=projects/transparency-dev-playground/locations/us-central1/services/ci-static-ct]
16:15:59.545 STDOUT terraform: module.cloudrun.google_cloud_run_v2_service.default: Still destroying... [id=projects/transparency-dev-playground/locations/us-central1/services/ci-static-ct, 10s elapsed]
16:15:59.754 STDOUT terraform: module.cloudrun.google_cloud_run_v2_service.default: Destruction complete after 10s
16:15:59.755 STDOUT terraform: module.cloudrun.google_project_service.cloudrun_api: Destroying... [id=transparency-dev-playground/run.googleapis.com]
16:15:59.756 STDOUT terraform: module.cloudrun.google_project_service.cloudrun_api: Destruction complete after 0s
16:15:59.760 STDOUT terraform: module.storage.google_project_service.storage_googleapis_com: Destroying... [id=transparency-dev-playground/storage.googleapis.com]
16:15:59.760 STDOUT terraform: module.storage.google_project_service.storage_api_googleapis_com: Destroying... [id=transparency-dev-playground/storage-api.googleapis.com]
16:15:59.761 STDOUT terraform: module.secretmanager.google_secret_manager_secret_version.sctfe_ecdsa_p256_private_key: Destroying... [id=projects/828026317866/secrets/ci-static-ct-ecdsa-p256-private-key/versions/1]
16:15:59.761 STDOUT terraform: module.storage.google_project_service.serviceusage_googleapis_com: Destroying... [id=transparency-dev-playground/serviceusage.googleapis.com]
16:15:59.761 STDOUT terraform: module.storage.google_project_service.storage_component_googleapis_com: Destroying... [id=transparency-dev-playground/storage-component.googleapis.com]
16:15:59.761 STDOUT terraform: module.storage.google_spanner_database.dedup_db: Destroying... [id=ci-static-ct/ci-static-ct-dedup-db]
16:15:59.761 STDOUT terraform: module.storage.google_spanner_database.log_db: Destroying... [id=ci-static-ct/ci-static-ct-db]
16:15:59.761 STDOUT terraform: module.secretmanager.google_secret_manager_secret_version.sctfe_ecdsa_p256_public_key: Destroying... [id=projects/828026317866/secrets/ci-static-ct-ecdsa-p256-public-key/versions/1]
16:15:59.761 STDOUT terraform: module.storage.google_storage_bucket.log_bucket: Destroying... [id=transparency-dev-playground-ci-static-ct-bucket]
16:15:59.763 STDOUT terraform: module.storage.google_project_service.storage_api_googleapis_com: Destruction complete after 0s
16:15:59.763 STDOUT terraform: module.storage.google_project_service.storage_googleapis_com: Destruction complete after 0s
16:15:59.763 STDOUT terraform: module.storage.google_project_service.storage_component_googleapis_com: Destruction complete after 0s
16:15:59.763 STDOUT terraform: module.storage.google_project_service.serviceusage_googleapis_com: Destruction complete after 0s
16:15:59.812 STDOUT terraform: module.secretmanager.google_secret_manager_secret_version.sctfe_ecdsa_p256_private_key: Destruction complete after 0s
16:15:59.813 STDOUT terraform: module.secretmanager.google_secret_manager_secret.sctfe_ecdsa_p256_private_key: Destroying... [id=projects/transparency-dev-playground/secrets/ci-static-ct-ecdsa-p256-private-key]
16:15:59.814 STDOUT terraform: module.secretmanager.google_secret_manager_secret_version.sctfe_ecdsa_p256_public_key: Destruction complete after 0s
16:15:59.816 STDOUT terraform: module.secretmanager.tls_private_key.sctfe_ecdsa_p256: Destroying... [id=52426d9cfafb769f86aa108b31bc550ba6017526]
16:15:59.816 STDOUT terraform: module.secretmanager.google_secret_manager_secret.sctfe_ecdsa_p256_public_key: Destroying... [id=projects/transparency-dev-playground/secrets/ci-static-ct-ecdsa-p256-public-key]
16:15:59.819 STDOUT terraform: module.secretmanager.tls_private_key.sctfe_ecdsa_p256: Destruction complete after 0s
16:16:00.080 STDOUT terraform: module.secretmanager.google_secret_manager_secret.sctfe_ecdsa_p256_public_key: Destruction complete after 0s
16:16:00.188 STDOUT terraform: module.secretmanager.google_secret_manager_secret.sctfe_ecdsa_p256_private_key: Destruction complete after 0s
16:16:00.189 STDOUT terraform: module.secretmanager.google_project_service.secretmanager_googleapis_com: Destroying... [id=transparency-dev-playground/secretmanager.googleapis.com]
16:16:00.190 STDOUT terraform: module.secretmanager.google_project_service.secretmanager_googleapis_com: Destruction complete after 0s
16:16:00.423 STDOUT terraform: module.storage.google_spanner_database.dedup_db: Destruction complete after 0s
16:16:00.436 STDOUT terraform: module.storage.google_spanner_database.log_db: Destruction complete after 0s
16:16:00.437 STDOUT terraform: module.storage.google_spanner_instance.log_spanner: Destroying... [id=transparency-dev-playground/ci-static-ct]
16:16:00.844 STDOUT terraform: module.storage.google_spanner_instance.log_spanner: Destruction complete after 1s
16:16:01.549 STDOUT terraform: module.storage.google_storage_bucket.log_bucket: Destruction complete after 2s
16:16:01.693 STDOUT terraform: Destroy complete! Resources: 16 destroyed.
Finished Step #7 - "terraform_destroy_conformance_ci"
PUSH
DONE
```